[{"date":1598331600,"excerpt":"\u003cp\u003e![](\u003ca href=\"https://lh3.googleusercontent.com/6Wsv72nB_GVolxNdQu-seiC_iMCDJdk96UGX-AwywboA9bZp8r89LzsYSvnlIjNEnyizUMY-rU8EKvP8RlmKakm_O0F8RvWQvh1xAGi7H33NEkK0iYYUfXfmiVrwkrL1CCczLV6j\"\u003ehttps://lh3.googleusercontent.com/6Wsv72nB_GVolxNdQu-seiC_iMCDJdk96UGX-AwywboA9bZp8r89LzsYSvnlIjNEnyizUMY-rU8EKvP8RlmKakm_O0F8RvWQvh1xAGi7H33NEkK0iYYUfXfmiVrwkrL1CCczLV6j\u003c/a\u003e =624x805)\u003c/p\u003e\n\u003cp\u003eThe Coronavirus pandemic has forced the world to make changes and adapt in virtually all aspects of life. With the school year quickly approaching, it is becoming more and more apparent that school may look very different for young students this year. With that in mind, it is very important that your children have a space that makes adapting to zoom schooling a little easier and helps separate their work and school space from the rest of your home. ![](\u003ca href=\"https://lh4.googleusercontent.com/sa32LyNkxzfeUk-LNpqg6eBpjaetPckc2asid-g548ROTC96iyJ9klyl-hWf_sAOtdtBoLl1cofBQGPFaJFlcafSiUgSmS50LmMRS15uZgu7364qv9u9XZ8clJdq9IyvVhDuDI-d\"\u003ehttps://lh4.googleusercontent.com/sa32LyNkxzfeUk-LNpqg6eBpjaetPckc2asid-g548ROTC96iyJ9klyl-hWf_sAOtdtBoLl1cofBQGPFaJFlcafSiUgSmS50LmMRS15uZgu7364qv9u9XZ8clJdq9IyvVhDuDI-d\u003c/a\u003e =624x416)\u003c/p\u003e\n\u003cp\u003eHere at On Point, we design and create custom homes that suit each and every one of your needs and desires. This new normal of working from home and homeschooling has really highlighted just how important work spaces are in every home. Rather than having the kids homework pile up on the dining room table, this built in desk area allows your student to have a designated work space, making homeschooling a little less hectic. Here we have included some of our past projects where we have incorporated built in shelving and desk space.\u003c/p\u003e\n\u003cp\u003e![](\u003ca href=\"https://lh6.googleusercontent.com/ydxLV-RATt9MSb6cypSMFa3pyUzB24EAzP8M0yPvBmwHrvZ1HojJXjjmAgzwyaESCZVVc-e4qpiVd-MA2OFd2fFVWuP0EjAWlExS9cIxTHyWUnyTEq8uTwTVOv8O4WUwNvJthnXn\"\u003ehttps://lh6.googleusercontent.com/ydxLV-RATt9MSb6cypSMFa3pyUzB24EAzP8M0yPvBmwHrvZ1HojJXjjmAgzwyaESCZVVc-e4qpiVd-MA2OFd2fFVWuP0EjAWlExS9cIxTHyWUnyTEq8uTwTVOv8O4WUwNvJthnXn\u003c/a\u003e =624x416)\u003c/p\u003e\n\u003cp\u003eNo matter what your work from home needs are, On Point can help those needs a reality. For more information on how to make your dream custom home come to life, visit our website at onpointcustomhomes.com\u003c/p\u003e\n","href":"/blog/desks/","link":"designing-the-perfect-at-home-student-station","objectID":"49631ff9c9f03a7c329dd159c76362aa","title":"Designing the Perfect At Home Student Station","type":"post"},{"date":1596517200,"excerpt":"\u003cp\u003e\u003cem\u003eThis article was published in the\u003c/em\u003e \u003ca href=\"https://www.chron.com/news/article/Upgrade-your-HVAC-for-purer-air-15393939.php\"\u003e_Houston Chronicle. _\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eNow more than ever, we are all hyper-aware of all things health and wellness. Due to the COVID-19 pandemic, there is a heightened awareness of and desire to remain as healthy and clean as possible, both inside and out. While it can be difficult to control what you are coming into contact with when out in public, there is a solution for avoiding unwanted bacteria, germs, allergens, and pollutants in your home — install an air purification system.\u003c/p\u003e\n\u003cp\u003eKnowing where to start in terms of finding the best solution for air purification can be daunting. There are countless products and companies that claim to have the solution for all your AC wants and needs.\u003c/p\u003e\n\u003cp\u003eA simple way to start is to determine what you want out of an air purification system. Some may be looking to reduce dust build-up throughout the house or to filter out the pollen and dander that trigger seasonal allergies. Some might have more compromised immune systems and want to ensure that the air they are breathing in their own homes isn’t putting their health at risk.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1591377035/OnPoint%20Custom%20Homes/0N8A0055_200605120540_mnzqv5.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eWhatever your desires may be, there is an air purification system that is sure to help provide a safe, clean environment for you and your family.\u003c/p\u003e\n\u003cp\u003eOne of the most cost-efficient options when thinking about air purification is installing a HVAC air purifying filter. The system essentially traps the bacteria and dust traveling through the air into the filter. While this option can be effective in reducing much of the dust build-up, it can only work while your AC is running, reducing the amount of time it spends eliminating the buildup of bacteria and allergens throughout your home.\u003c/p\u003e\n\u003cp\u003eAnother technology proven to be effective in improving air quality is UV light. A UV light can be installed into your HVAC system and is known to protect from and eliminate many of the contaminants that enter the HVAC system. The APCO-X In-Duct Air Purification System utilizes UV light technology to disinfect the HVAC coils, avoiding the buildup of mold, dust, etc. which can then travel throughout your home.\u003c/p\u003e\n\u003cp\u003eA great option for more drastic air purification is the REME HALO In-duct Air Purifier. This product is intended to be used along with your existing HVAC unit. The technology allows for the air to be purified without having to pass through a filter in the unit, ensuring that every room receives the benefits of this product. This air purifier reduces allergens and kills bacteria and viruses as they enter your home, without the need to clean or replace filters.\u003c/p\u003e\n\u003cp\u003eWhile there are a wide variety of options, no matter which air purification system you select, you can rest easy knowing you are taking a huge step towards creating a healthier environment in your home. If you’re interested in learning more, contact your builder, remodeler or HVAC specialist to ask what options are available for your HVAC unit.\u003c/p\u003e\n","href":"/blog/hvacpurerair/","link":"upgrade-your-hvac-for-purer-air","objectID":"a06fb6a0bade415507b2f4d13ea60206","title":"Upgrade your HVAC for purer air","type":"post"},{"date":1595998800,"excerpt":"\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1596029385/OnPoint%20Custom%20Homes/1_hyjp23.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eWe look forward to the Texas Association of Builders STAR awards every year! Usually our team packs up and heads to the Sunbelt Builder Show for the trade show and award ceremony, but this year looked a bit different! While we couldn\u0026rsquo;t explore the trade show and award ceremony in person this year, it didn\u0026rsquo;t stop our team from celebrating our big wins!\u003c/p\u003e\n\u003cp\u003eThis year we were honored to take home FIVE Awards for design + marketing.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1596029829/OnPoint%20Custom%20Homes/star_2020_a68typ.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHarold Residence\u003c/strong\u003e\u003cbr\u003e\nBest Architectural Design\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1572277967/OnPoint%20Custom%20Homes/0N8A3338_gyqr5a.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1572277963/OnPoint%20Custom%20Homes/0N8A3311_cxhuaq.jpg\" alt=\"\"\u003e\u003cbr\u003e\n\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1572277964/OnPoint%20Custom%20Homes/0N8A3458_frt_le1bdz.jpg\" alt=\"\"\u003e\u003cbr\u003e\n\u003cstrong\u003eKnox Residence\u003c/strong\u003e\u003cbr\u003e\nBest Interior Design\u003cbr\u003e\nBest Master Bedroom\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1591378561/OnPoint%20Custom%20Homes/0N8A4545_ile8zn.jpg\" alt=\"\"\u003e\u003cbr\u003e\n\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1591378582/OnPoint%20Custom%20Homes/0N8A4557_khaqym.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1591378686/OnPoint%20Custom%20Homes/0N8A4728_xcc9ew.jpg\" alt=\"\"\u003e\u003cbr\u003e\n\u003cstrong\u003eDriscoll Residence\u003c/strong\u003e\u003cbr\u003e\nBest Interior Design\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1561732603/OnPoint%20Custom%20Homes/6J3A5055PHOTORESIZERCROPRESIZEANDSHAREIMAGESINBATCH627201962346PM.jpg\" alt=\"\"\u003e\u003cbr\u003e\n\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1561732808/OnPoint%20Custom%20Homes/6J3A5026PHOTORESIZERCROPRESIZEANDSHAREIMAGESINBATCH627201962335PM.jpg\" alt=\"\"\u003e\u003cbr\u003e\n\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1591377938/OnPoint%20Custom%20Homes/6J3A5133_hbmedd.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eWe couldn\u0026rsquo;t do the work we do without our amazing team who brings these homes to life with their thoughtful design + stunning attention to detail. We look forward to another year of amazing new homes.\u003c/p\u003e\n\u003cp\u003eLearn more about our design + build services \u003ca href=\"https://onpointcustomhomes.com/\"\u003ehere\u003c/a\u003e!\u003c/p\u003e\n","href":"/blog/2020tabawards/","link":"texas-association-of-builders-2020-award-wins","objectID":"c3e4dbdde56c98db39978c431ea6c3a8","title":"Texas Association of Builders 2020 Award Wins!","type":"post"},{"date":1594357200,"excerpt":"\u003cp\u003eOne thing all Texans can agree on is just how unpredictable the weather here can be. Knowing how to navigate these weather changes when it comes to maintaining a yard can become a huge hassle for homeowners. However, there are many landscaping options that can eliminate or reduce the need for serious maintenance in your yard.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1591373605/OnPoint%20Custom%20Homes/VALLEY_FORGE_24_opjvmm.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eTurf is a great option for those looking for a virtually maintenance-free yard. Making the decision to install turf instead of grass in your yard may seem costly, however, you actually end up saving far more in the long run when you eliminate the need for sprinkler systems or yard work. Along with the long-term savings that come with turf, you are able to make sure you have a yard that can hold up against almost any weather that comes your way. No matter the season, turf ensures that you have a beautiful, green yard year-round.\u003c/p\u003e\n\u003cp\u003eWhile there are many realistic turf options to choose from, some still prefer the look and feel of real grass and plants. That is where xeriscaping comes in. With xeriscaping, plants and grasses are selected that are designed to withstand unpredictable weather patterns with little watering needed. This allows homeowners to have all the benefits of a beautifully landscaped yard without all of the time-consuming maintenance that typical landscaping requires. If xeriscaping is the route you chose to take, On Point will help create a beautiful landscaping design using low-water plants and beautiful rock beds to create a calming and hassle-free yard.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1569332483/OnPoint%20Custom%20Homes/0N8A9214_190924083820_lzdkn0.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eAdditionally, On Point always installs a digitally controlled sprinkler system which ensures that your yard receives the amount of watering it needs without having to think about it. The sprinkler system also includes foundation moisture control to increase the stability of your home long term.\u003c/p\u003e\n\u003cp\u003eNo matter what route you choose to take, On Point ensures that your yard will be hassle-free and taken care of year-round in the most cost-efficient way.\u003c/p\u003e\n","href":"/blog/turf_xeriscaping/","link":"turf-+-xeriscaping-how-to-create-a-maintenance","objectID":"2571083efd5c917afb6e728b71c2e9d0","title":"Turf + Xeriscaping - How to Create a Maintenance ","type":"post"},{"date":1583301600,"excerpt":"\u003cp\u003eWe are thrilled to once again partake in the MA+DS Modern Home Tour! This year\u0026rsquo;s tour is Saturday, March 28 from 11 a.m. - 5 p.m. and you can purchase tickets online \u003ca href=\"https://www.eventbrite.com/e/2020-mads-10th-annual-houston-modern-home-tour-tickets-88976636515?discount=ONPOINT2020\"\u003ehere\u003c/a\u003e. Use code ONPOINT2020 for $5 off!\u003c/p\u003e\n\u003cp\u003eMeet the team that designed + built 2300 South Blvd and tour this amazing modern home that is ADA compliant home!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1583337252/OnPoint%20Custom%20Homes/ma_ds_tour_utouim.png\" alt=\"\"\u003e\u003c/p\u003e\n","href":"/blog/madshometour/","link":"join-us-on-the-ma+ds-modern-home-tour","objectID":"311eb7bcf7e33c4868655b4257be7aef","title":"Join us on the MA+DS Modern Home Tour!","type":"post"},{"date":1579672800,"excerpt":"\u003cp\u003eWe are looking for an enthusiastic individual to join our team to lead selection management and client concierge services. Ideal candidate has a passion for design and thrives in a collaborative, fast-paced office environment. Three years of residential design experience required. Construction and purchasing experience preferred. This position entails the following:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob responsibilities include the following:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLead all internal spec home selections, collaborating with the Architectural team, to design a unique design package for every On Point spec home\u003c/li\u003e\n\u003cli\u003eLead all custom clients through the selections process ensuring an exceptional experience while remaining on schedule, this includes providing design guidance and inspiration, detailed timelines for selection needs, scheduling show room visits, coordinating vendor/client meetings and executing selection sign offs\u003c/li\u003e\n\u003cli\u003eAssist Architectural and Purchasing teams with specifications for spec and custom homes\u003c/li\u003e\n\u003cli\u003eProvide status updates to clients throughout the design + build process, serving as the main point of contact for all client needs\u003c/li\u003e\n\u003cli\u003eSend selection and change order requests to clients for sign-off\u003c/li\u003e\n\u003cli\u003ePresent clients with design inspiration and create all design portfolio booklets for spec homes\u003c/li\u003e\n\u003cli\u003eManage vendor receivables and bids as it relates to selection needs\u003c/li\u003e\n\u003cli\u003eManage vendor relationships and product knowledge base\u003c/li\u003e\n\u003cli\u003eCreate home warranty packets for homeowners\u003c/li\u003e\n\u003cli\u003eAssist with purchasing takeoffs and bids, as needed\u003c/li\u003e\n\u003cli\u003eExecute purchase orders, as needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eJob requires the following skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassion for interior design and residential real estate\u003c/li\u003e\n\u003cli\u003eAbility to interpret plans and provide material take-offs\u003c/li\u003e\n\u003cli\u003eStrong product knowledge and experience working with varying design budgets\u003c/li\u003e\n\u003cli\u003eStrong organization skills with the ability to juggle and prioritize multiple projects\u003c/li\u003e\n\u003cli\u003eExcellent oral and written communication skills, able to effectively work with internal and external collaborators\u003c/li\u003e\n\u003cli\u003eOrganized, self-starter that can complete tasks without regular supervision\u003c/li\u003e\n\u003cli\u003eAbility to set and meet internal and external deadlines and ensure necessary deliverables are collected on time and within budget\u003c/li\u003e\n\u003cli\u003eMust be accustomed to owning their workload and handle multiple tasks with ease in a fast-paced environment\u003c/li\u003e\n\u003cli\u003eTech Savvy, Process improver, idea maker, problem solver, innovative, with a good personality\u003c/li\u003e\n\u003cli\u003eProficient with Microsoft Office (Excel, Word, Power Point \u0026amp; Outlook)\u003c/li\u003e\n\u003cli\u003eDriver’s license and reliable transportation required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur team is in need of a creative individual to lead our selections and design efforts for all custom and spec home projects. We’re looking for someone with a positive and professional attitude who is eager to work with clients and lead them through the custom home design process. Job responsibilities require a high level of focus and attention to detail combined with an ability to prioritize and manage time efficiently. We expect this team member to have the drive and dedication to learn and continually grow within our fast-paced and expanding company.\u003c/p\u003e\n","href":"/blog/selectionsspecialist/","link":"love-design-were-looking-for-a-selections-specialist","objectID":"288fcbaecf08fc3287fa350ecd0fcabb","title":"Love Design?! We're Looking for a Selections Specialist! ","type":"post"},{"date":1579240800,"excerpt":"\u003cp\u003eWe are looking for an individual for a marketing + sales associate position with a desire to learn more about the residential real estate industry to assist and support our sales + marketing team. Ideal candidate has at least 2-years of previous employment or internship experience in an office setting. Marketing experience and a passion for real estate required.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob responsibilities include the following:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreate and execute engaging and creative monthly marketing campaigns for multiple online platforms including Facebook, LinkedIn, Instagram, email marketing and blogs\u003c/li\u003e\n\u003cli\u003eManage client database and oversee lead generation and marketing efforts\u003c/li\u003e\n\u003cli\u003eManage and update website(s), blog(s), email marketing pieces and online social media accounts regularly to promote active listings, service offerings and overall enhancement of agent’s and company’s social media presence\u003c/li\u003e\n\u003cli\u003eCreate engaging text, image and video content for online platforms to drive marketing and sales efforts and showcase company news and culture\u003c/li\u003e\n\u003cli\u003eWork with sales principals to prepare all listing materials: pre-listing presentation, listing agreement, sellers’ disclosures, comparative market analysis, pull online property profile, research old multiple listing service (MLS) listings, etc.\u003c/li\u003e\n\u003cli\u003eCoordinate the preparation of all listing and open house flyers, graphics, signage and all other marketing materials including MLS and website listings\u003c/li\u003e\n\u003cli\u003eConsult and coordinate with sellers and vendors on all property photos, videos, staging, repairs, cleaning, signage, lockbox, access requirements and marketing activities\u003c/li\u003e\n\u003cli\u003eCoordinate private showings, public open houses and broker open houses and obtain feedback for sellers regarding all showings and marketing activities\u003c/li\u003e\n\u003cli\u003eOversee buyer and seller transactions from contract to executed purchase agreement and closing including obtaining contract signatures, coordinating title/escrow, mortgage loan and appraisal processes as well as oversee closing and possession schedules; Coordinate inspections, assist in negotiations as needed\u003c/li\u003e\n\u003cli\u003eCoordinate all client and vendor appreciation events and partnership opportunities\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eJob requires the following skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassion for real estate and the desire to learn and grow within the industry\u003c/li\u003e\n\u003cli\u003eExcellent oral and written communication skills, able to effectively work with internal and external collaborators\u003c/li\u003e\n\u003cli\u003eGraphic design and social media expertise including Facebook, Instagram, LinkedIn and Canva or Photoshop (or other graphic design programs)\u003c/li\u003e\n\u003cli\u003eOrganized, self-starter that can complete tasks without regular supervision\u003c/li\u003e\n\u003cli\u003eMust be accustomed to owning their workload and handle multiple tasks with ease in a fast-paced environment\u003c/li\u003e\n\u003cli\u003eProcess improver, idea maker, problem solver, innovative, with a good personality\u003c/li\u003e\n\u003cli\u003eProficient with Microsoft Office (Excel, Word, Power Point \u0026amp; Outlook)\u003c/li\u003e\n\u003cli\u003eDriver’s license and reliable transportation required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur team is in need of an enthusiastic individual to work with our sales and marketing team to enhance brand recognition and sales initiatives. We require a positive and professional attitude while working with internal and external partners. The tasks described above require a high level of focus and attention to detail combined with an ability to prioritize and manage time efficiently. We expect this team member to have the drive and dedication to learn and continually grow within our fast-paced and successful company.\u003c/p\u003e\n\u003cp\u003eEmail Ashley Tucker \u003ca href=\"mailto:at@opcustomhomes.com\"\u003eat@opcustomhomes.com\u003c/a\u003e to apply. Subject Line: Real Estate Marketing + Sales Associate\u003c/p\u003e\n","href":"/blog/hiringsales/","link":"were-hiring-real-estate-marketing-+-sales-associate","objectID":"7cc97b36fe6a54f28081e00a96d5316d","title":"We're Hiring! Real Estate Marketing + Sales Associate","type":"post"},{"date":1567141200,"excerpt":"\u003cp\u003eWe are in search of an enthusiastic accounting professional to oversee and manage all office accounting tasks including, but not limited to, accounts receivables/payables, analysis of financial statements and various financial reporting for multiple entities. Candidate must be extremely proficient in QuickBooks. This position would be responsible for the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOversee Accounts Payables and Accounts Receivables\u003c/li\u003e\n\u003cli\u003eUpdate cash flow forecasts on a weekly basis\u003c/li\u003e\n\u003cli\u003eWork with Banks/Clients to create and manage Draw Schedules for multiple projects\u003c/li\u003e\n\u003cli\u003ePerform weekly bank draws for multiple projects, provide the appropriate backup, and serve as the main point of contact for the multiple banks\u003c/li\u003e\n\u003cli\u003eResponsible for managing Variance Reporting\u003c/li\u003e\n\u003cli\u003eResponsible for managing all audits and reconciliations\u003c/li\u003e\n\u003cli\u003eAnalyze and complete financial statements for multiple entities\u003c/li\u003e\n\u003cli\u003eCapable of both completing all transactions in QuickBooks for multiple entities including journal entries for month end and quarter end close. Must be able to work independently and perform the prelim review of financial reports monthly.\u003c/li\u003e\n\u003cli\u003eTech savvy individual who is willing to jump into different systems like QuickBooks online and add-in Apps for bank feeds, credit card feeds, uploads, etc.\u003c/li\u003e\n\u003cli\u003eCapable of jumping between tasks, ensuring all items are finished in an effective and efficient manner\u003c/li\u003e\n\u003cli\u003eAbility to meet and exceed deadlines in a fast-paced environment\u003c/li\u003e\n\u003cli\u003eThe ability to offer suggestions on how to book journal entries, fix G/L accounts and correct issues in the ledger\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe tasks described above require a high level of focus and attention to detail combined with an ability to prioritize and manage time efficiently. Ability to analyze data and problem solve effectively required. We expect this team member to be a self-starter with the drive and dedication to learn and continually grow within our fast-paced environment.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualifications:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e1. Minimum four years of recent experience with full cycle accounting\u003c/p\u003e\n\u003cp\u003e2. Bachelor’s Degree in Accounting and/or Finance\u003c/p\u003e\n\u003cp\u003e3. Proficient in QuickBooks Online \u0026amp; Microsoft Office with strong Excel skills (vlookups, pivot tables, advanced formulas)\u003c/p\u003e\n\u003cp\u003e4. Strong communication skills\u003c/p\u003e\n\u003cp\u003e5. Organized, self-starter that can complete tasks without regular supervision\u003c/p\u003e\n\u003cp\u003e6. Must be accustomed to owning their workload and handle multiple tasks with ease\u003c/p\u003e\n\u003cp\u003e7. Experience dealing with multiple entities is a huge plus\u003c/p\u003e\n\u003cp\u003e8. Process improver, idea maker, problem solver, innovative, with a good personality\u003c/p\u003e\n\u003cp\u003ePlease email your resume and cover letter to Ashley at \u003ca href=\"mailto:at@opcustomhomes.com\"\u003eat@opcustomhomes.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSubject reading: Accounting Specialist – Your Name.\u003c/p\u003e\n","href":"/blog/accountingspecialist/","link":"come-work-with-us-now-hiring-an-accounting-specialist","objectID":"1932dd9df826bfdd052c4338650a734e","title":"Come Work With Us! Now Hiring an Accounting Specialist","type":"post"},{"date":1557291600,"excerpt":"\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders13-680x408.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/personnel/earl-correll/\"\u003eEarl\u003c/a\u003e and \u003ca href=\"https://onpointcustomhomes.com/personnel/dana-walker/\"\u003eDana\u003c/a\u003e represented On Point for the Spring 2019 session of the Master Builders hosted by the enterprising owners and staff at Gradison Design-Build. Twice a year, a members invite-only group of construction industry leaders from the United States and Caribbean gather to share three days and nights of intensive sessions consisting of financial overviews, round-table discussions, best practices discussion forums, innovative construction techniques, the latest in applied technology and software, material sourcing and pricing, project reviews, site tours, vendor showcases and shared camaraderie. We look forward to these ongoing opportunities twice a year to not only help mentor, but be mentored and motivated by one another to strive for improved procedures and elevated goals. This particular session included the valuable addition of each company’s Selections Coordinator who engaged in their own simultaneous symposium of systems analysis, processes and procedures review, selections trends and vendor sourcing.\u003c/p\u003e\n\u003cp\u003eLocal activities hosted by Team Gradison included a “Best Practices” discussion and Happy Hour hosted by the talented team at Ferguson Enterprises at the Indiana Design Center in Carmel, a presentation by Keynote Speaker Glenn Bill on “What it Takes to be a Good Builder From a Realtor Perspective”, and Project/Site Tours of Gradison Homes current projects and model homes in the communities of Maple Ridge, Chatham Hills and South Village of Nickel Plate. And of course, no visit to Indianapolis would be complete without a tour of the infamous Mass Ave District with a sips and bites tour of the local brews and delicious pub fare.\u003c/p\u003e\n\u003cp\u003ePresentations/Discussions\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders20.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders-construct.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/1000x600.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eFerguson Enterprises Happy Hour\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders10.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders9.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders11.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eGradison Homes Tour – South Village\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders-construct2.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders24.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders22.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders21.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eChatham Hills Site Tour\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders5.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eMaple Ridge Site Tour\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders13.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders14.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eMass Ave district\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://www.encompasscayman.com/wp-content/uploads/2019/04/encompass-master-builders16.jpg\" alt=\"\"\u003e\u003c/p\u003e\n","href":"/blog/master-building-meeting/","link":"earl-+-dana-visit-indy-for-master-builder-meeting","objectID":"f6e26b99d29476404e30a6eaef0a7f60","title":"Earl + Dana Visit Indy for Master Builder Meeting","type":"post"},{"date":1540267200,"excerpt":"\u003cp\u003eThese days “smart home” is at the top of many homeowner’s wish list and at On Point, part of our mission is to always stay ahead of the building curve and embrace emerging technology, so our homes are never behind the times. While you may think of Nest, Eco Bee, Alexa and Ring when you think of smart homes, On Point’s integration of smart technology goes much further than being install-ready for trending tech products. In fact, our team is already thinking about how the emergence of 5G technology will change how your home operates.\u003c/p\u003e\n\u003cp\u003eOn Point installs a variety of items during construction to ensure your home is technology ready. First things first, we always pre-wire every space so your house is ready for any low-voltage needs. That means your house is ready for surround sound, speakers, alarm and security features and more. In a single-family home, we pre-wire for roughly four camera locations in order to surveillance the driveway, front door and backyard areas. Your master bedroom and bathroom are ready for TVs and speakers as is your kitchen, dining room and covered outdoor spaces. The living room and any game rooms are even ready for a complete surround sound system. If one of our homes has a metal gate, we also pre-wire for an electronic strike entry system.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553369237/OnPoint%20Custom%20Homes/432535.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eGoing above and beyond pre-wiring, at On Point we actually install a full security system in your house, so all you have to do is activate service after you move in. When you buy an On Point home, your doors and windows will have security sensors pre-installed. Additionally, we install glass break sensors and a security panel in your mudroom or off the garage entry. Many of our custom clients opt to install a second control panel in the master suite, so we always pre-wire for a second panel in the master as well. If you want to install cameras, all the wiring is complete for an easy install. Want Fiber connection? Don’t worry! We run conduit wiring outside your home so it’s Fiber ready.\u003c/p\u003e\n\u003cp\u003eOutside of all the pre-wiring work, On Point installs Rinnai tankless water heaters with a recirculating pump in our homes. Unlike traditional tank water heaters, that hold and heat water whether or not it’s being used, tankless heaters are more energy efficient as they heat only the water that is being used. Because it heats the water as it runs, one of the biggest benefits of a tankless heater is that it will provide endless hot water. The recirculating pump that we add helps ensure that hot water comes out almost immediately, rather than waiting a few seconds to kick in. Rinnai is also known for having smart features that help alert you of maintenance issues and troubleshooting. Rinnai even has water heaters that connect to an app for phone control.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553369226/OnPoint%20Custom%20Homes/54325.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eLast, but not least, we install a\u003cstrong\u003epest control system\u003c/strong\u003ein the walls of your home to help combat future issues. Not only do we treat the first-floor base plate wood with Borate before we sheetrock the walls, but we also run an in-wall system that allows for easy future pest treatment. The system involves a small hose with holes that is run through the walls and connects to a port on the exterior of your home. When it’s time for treatment, the pest company can hook into the hose system and spray for pests without having to come inside your home.\u003c/p\u003e\n\u003cp\u003eThere are endless ways to make your home tech ready and at On Point, our team is always exploring opportunities to build technology into our homes no matter the form. From WIFI and Bluetooth enabled appliances and products to sophisticated AV closets and wiring systems, your On Point home is smarter than you think!\u003c/p\u003e\n","href":"/blog/basics-of-building-pre-wiring-smart-home-tech/","link":"basics-of-building-pre-wiring-+-smart-home-tech","objectID":"783556ea362e3c4b3aca46b95d542a49","title":"Basics of Building: Pre-Wiring + Smart Home Tech","type":"post"},{"date":1538971200,"excerpt":"\u003cp\u003eThe office is looking a bit shinier this week! As many of you know, On Point is a proud member of the Greater Houston Builder’s Association and has been since we started building. One of our favorite annual company traditions is the GHBA PRISM Awards + Gala! Over the last ten+ years, we’ve won multiple design and marketing \u003ca href=\"https://onpointcustomhomes.com/about-us/recognition/\"\u003eawards\u003c/a\u003e and the streak continues.\u003c/p\u003e\n\u003cp\u003eWe were honored to bring home six “Houston’s Best” awards and were finalists in six additional categories. From Best Custom Home \u003ca href=\"https://onpointcustomhomes.com/our-portfolio/\"\u003eDesign\u003c/a\u003e to Best Whole Home \u003ca href=\"https://onpointcustomhomes.com/remodels/\"\u003eRemodel\u003c/a\u003eand more, we are so proud of our amazing \u003ca href=\"https://onpointcustomhomes.com/about-us/team/\"\u003eteam\u003c/a\u003e for their hard work and dedication to excellence in all that they do. Take a look at some of our favorite award winners!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553368858/OnPoint%20Custom%20Homes/Screen-Shot-2018-10-08-at-11.04.11-AM.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553368917/OnPoint%20Custom%20Homes/Screen-Shot-2018-10-08-at-11.04.56-AM.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553368899/OnPoint%20Custom%20Homes/5435.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553368883/OnPoint%20Custom%20Homes/3424.jpg\" alt=\"\"\u003e\u003c/p\u003e\n","href":"/blog/new-awards-from-the-ghba/","link":"new-awards-from-the-ghba","objectID":"87ec8a7608e65015e2c7a4f71e9447d0","title":"NEW AWARDS FROM THE GHBA!","type":"post"},{"date":1537848000,"excerpt":"\u003cp\u003eOne of the most common remodeling requests is the addition of built-ins. Not only do they add a focal point to the space, but built-ins also give you the opportunity to enhance your storage with the addition of new cabinetry. Adding or updating built-ins and cabinetry can make an enormous impact on your home’s aesthetic. That being said, there are endless styles when it comes to cabinetry design, so we’re breaking down what you need to know to get started.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553285076/OnPoint%20Custom%20Homes/OnPoint-Custom-Homes-00065-1400x1080.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eFirst things first, decide if you are adding floor-to-ceiling built-in bookcases or if you’d rather have built-in shelves with cabinet space below. If you are adding built-ins around a TV, make sure to leave enough white space after it’s mounted. Once you’ve decided on your layout, choose your shelf style – adjustable or fixed design. Adjustable shelves provide flexibility to change the layout of your built-ins; however, the downside is you are left with small holes in the shelving. Fixed shelving doesn’t give you the option to change the layout, but you have the ability to create a more luxurious finished aesthetic.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284705/OnPoint%20Custom%20Homes/4.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eWhen adding cabinets below a built-in, or anywhere in your home, you have endless options for door-style, hardware selection and functionality. Our favorite must-have feature for cabinets are soft-close hinges. If you’re incorporating any drawers, soft-close gliders are also available, and we recommend splurging for full extension rails that allow you to pull out the entire drawer for easier accessibility.\u003c/p\u003e\n\u003cp\u003eFlat front, shaker and raised panel doors are the most common design options. The style door you choose will have the largest impact on your overall interior design goals. Flat front tends to be more modern, while shaker and raised panels bring more texture and tradition to your space. Before you move onto hardware selections, choose how you want your doors hung. Your contractor should ask if you want inset, overlay or full overlay cabinet doors. Inset cabinets + drawers sit within the frame, while overlay sits over the frame. Full-overlay sits over the frame as well but extends all the way to the edge of the frame covering it entirely.\u003c/p\u003e\n\u003cp\u003eMore often than not, we job-build all of our wood-work as it gives our clients more control over the design and layout. Pre-fabricated cabinets and bookshelves are always an option, but keep in mind some manufactured cabinetry come in pre-set sizes which makes fitting it into an existing space somewhat of a challenge. On the plus side, manufactured cabinets come painted and ready to install which can speed up your remodel timeline.\u003c/p\u003e\n\u003cp\u003eLast but not least is selecting your hardware, which can be the most fun and the most overwhelming decision. Adding modern hardware to a traditional door creates a blended style and vice-versa. With endless options in a variety of finishes, hardware is the final touch that brings your design to life.\u003c/p\u003e\n","href":"/blog/designing-your-perfect-built-ins-cabinets/","link":"designing-your-perfect-built-ins-cabinets","objectID":"8208c7815f19459b154726949a0adeed","title":"Designing Your Perfect Built-Ins \u0026 Cabinets","type":"post"},{"date":1537243200,"excerpt":"\u003cp\u003eWe’ve officially gotten through the worst of Houston’s hot and humid summer, but I’m sure many of you are still enjoying the luxury of a great air conditioning system as we creep info fall. You can have a great HVAC system, but it only goes so far without proper insulation. We’re dropping some knowledge on how we handle insulating our homes to ensure it’s as energy efficient as possible to keep your home’s temperature regulated all year long.\u003c/p\u003e\n\u003cp\u003eInsulation is installed after the house is framed and sheathed, and after all of your electrical, low voltage and plumbing rough-in has all be completed. Every home we build is insulated with open cell spray foam insulation as it is much more effective than traditional batt insulation (or the pink fluffy stuff you’re used to seeing).\u003c/p\u003e\n\u003cp\u003eThe process of spray-foam insulation is quite mesmerizing to watch, but because the foam formula is powerful, it’s important to stay out of the home for at least 24 hours after it’s installed. We mix in a fire-retardant into the spray foam before applying it on all of your exterior walls, your attic and roof. The technicians suit-up in protective gear to spray the foam in. As you can see below, the foam is flat at first and then slowly expands to fill in the space between the sheathing and framed. The spray expands anywhere from 3.5-5.5 inches and any overhanging foam is shaved down before the sheetrock is installed.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553367688/OnPoint%20Custom%20Homes/spray-foam-insulation-min.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eYou may be surprised to hear that not every wall in your home has insulation in it. Typically, insulation is only needed on exterior surfaces; however, it’s common for us to recommend insulating the walls around your master bedroom, utility room and even game rooms with batt insulation as a sound barrier. For any space that generates noise, or a space you’d want to be protected from outside noise, insulation can be installed as a sound barrier. There are various levels of sound barrier insulation if you need the space to be mildly or ultra soundproof.\u003c/p\u003e\n\u003cp\u003eWhen spray foam insulation is installed in your attic along the roof line, you don’t need additional insulation on the floor in the rafters. You may notice that the foam along your attic’s room is pretty thick. That’s because we apply a thicker layer of foam along the roof for extra protection.\u003c/p\u003e\n\u003cp\u003eIf you have a \u003ca href=\"https://onpointcustomhomes.com/blog/basics-of-building-foundation-fundamentals-part-3/\"\u003ecrawl space foundation\u003c/a\u003e, we install a layer of closed cell spray foam insulation along the bottom of your floor. This insulates the bottom layer of your home as it is exposed to the elements.\u003c/p\u003e\n\u003cp\u003eInsulation is an essential component of keeping your house cold in the summer and warm in the winter! Without the protective barrier, your home’s internal temperature (among other things) would be at the mercy of mother nature. Be smart and insulate well!\u003c/p\u003e\n","href":"/blog/basics-of-building-insulation/","link":"basics-of-building-insulation","objectID":"e797453480b65f7a135f1a8d4b358e33","title":"Basics of Building: Insulation","type":"post"},{"date":1534737600,"excerpt":"\u003cp\u003e\u003cstrong\u003ePosition:\u003c/strong\u003e Architectural Designer\u003cbr\u003e\n**Location:**Houston, TX\u003c/p\u003e\n\u003cp\u003e**Key Responsibilities\u003cbr\u003e\n**We are looking for an individual with a Bachelor’s of Architecture who is interested in residential construction and custom home building. This specific degree is preferred; however please note that favor may be given to those with a higher degree or level of accreditation. At least one year of formal work experience is preferred, and more than that is favored. This individual must be:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficient in Revit and CAD, and comfortable with a BIM environment and architectural documentation\u003c/li\u003e\n\u003cli\u003eWorking knowledge of Adobe Creative Suite (Illustrator, Photoshop)\u003c/li\u003e\n\u003cli\u003eUnderstand wood-frame construction and be familiar with residential building codes\u003c/li\u003e\n\u003cli\u003eIncorporate applicable building codes and standards into projects\u003c/li\u003e\n\u003cli\u003eAble to work in 2D and 3D through sketching and modeling\u003c/li\u003e\n\u003cli\u003eGenerate architectural renderings (interior + exterior) and construction drawings\u003c/li\u003e\n\u003cli\u003eAbility to convert schematic designs into construction documents\u003c/li\u003e\n\u003cli\u003ePrepare contract documents, including details, sections, elevations, and schedules as well as perform redline revisions\u003c/li\u003e\n\u003cli\u003ePerforms tasks according to On Point Custom Homes delivery standards\u003c/li\u003e\n\u003cli\u003eMust have strong graphic skills with attention to detail\u003c/li\u003e\n\u003cli\u003eExcellent oral and written communication skills\u003c/li\u003e\n\u003cli\u003eStrong organization skills with the ability to juggle and prioritize multiple projects\u003c/li\u003e\n\u003cli\u003eCreative problem solving\u003c/li\u003e\n\u003cli\u003eComfortable with one on one client interaction\u003c/li\u003e\n\u003cli\u003eBe located or willing to locate to the Houston area\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking for someone to work with our architectural design team and expect this individual to be design-conscious and detail oriented. Because On Point deals with a niche set of clientele with big ideas, our architectural designers must have a desire to work on the more artistic side of construction. The individual must be able to accurately and efficiently convert a unique idea into a visually pleasing work of art for the client. The individual must be open to critique and changing demands made by the client, as well as the rest of the On Point team. Open collaboration with the entire On Point team is critical. The custom home building industry is constantly changing, and here at On Point we strive to stay ahead of the change and work with new ideas and designs. We expect the newest member of our team to be willing and ready for the ever-changing environment, as well as prepared to be a part of a continually growing and successful company. Named \u003ca href=\"https://onpointcustomhomes.com/about-us/recognition/\"\u003eBest Places to Work\u003c/a\u003e by Houston Business Journal!\u003c/p\u003e\n\u003cp\u003ePlease email your resume and cover letter to \u003ca href=\"https://onpointcustomhomes.com/personnel/charles-pelini-aia/\"\u003eCharles\u003c/a\u003e at \u003ca href=\"mailto:cp@opcustomhomes.com\"\u003ecp@opcustomhomes.com\u003c/a\u003eSubject reading: Architectural Candidate – Your Name. Feel free to include your portfolio; however, please limit file to 4MB.\u003c/p\u003e\n","href":"/blog/join-team-now-hiring-architectural-designer-2/","link":"join-the-team-now-hiring-for-an-architectural-designer","objectID":"f7551167725b3dfe595496a3fb715602","title":"Join the Team - Now Hiring for an Architectural Designer","type":"post"},{"date":1534132800,"excerpt":"\u003cp\u003eIf you follow the adventures of On Point on \u003ca href=\"https://www.facebook.com/OnPointCustomHomes/?fref=ts\"\u003eFacebook\u003c/a\u003e and \u003ca href=\"https://www.instagram.com/onpointcustomhomes/\"\u003eInstagram\u003c/a\u003e, you’ve probably heard the news already, but if not, we’re excited to share that our team brought home some new hardware from the Texas Association of Builders! And by hardware, we mean \u003ca href=\"https://onpointcustomhomes.com/about-us/recognition/\"\u003eawards\u003c/a\u003e, although we probably brought back some actual hardware samples, too.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366252/OnPoint%20Custom%20Homes/IMG_2361-1400x1050.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366253/OnPoint%20Custom%20Homes/40096945_10156594204299913_4069555390692458496_n-214x300.jpg\" alt=\"\"\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366254/OnPoint%20Custom%20Homes/39984924_10156594205784913_3536127152678240256_n-214x300.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366252/OnPoint%20Custom%20Homes/39962169_10156594205829913_2490846427681390592_o-300x214.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/personnel/garrett-nance/\"\u003eGarrett\u003c/a\u003e, \u003ca href=\"https://onpointcustomhomes.com/personnel/tiffany-trask/\"\u003eTiffany\u003c/a\u003e and \u003ca href=\"https://onpointcustomhomes.com/personnel/ashley-tucker/\"\u003eAshley\u003c/a\u003e spent the last half of last week in Dallas attending the Sunbelt Builders Show put on by the Texas Association of Builders. The highlight of the trip was the STAR Award Show, which recognizes excellence in all areas of the home building industry. With more than 500 entries, the STAR awards are the largest award show in the state and On Point was pleased to take home three new awards! Take a look below to see what we won and browse photos from each project!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBest Architectural Design\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366254/OnPoint%20Custom%20Homes/emomedia.net_edit.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366253/OnPoint%20Custom%20Homes/emomedia.net-40.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366253/OnPoint%20Custom%20Homes/emomedia.net-29.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366252/OnPoint%20Custom%20Homes/emomedia.net-39.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366261/OnPoint%20Custom%20Homes/emomedia.net-13-1.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366256/OnPoint%20Custom%20Homes/emomedia.net-20.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366255/OnPoint%20Custom%20Homes/emomedia.net-19.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366257/OnPoint%20Custom%20Homes/emomedia.net-10.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBest Master Bedroom\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366255/OnPoint%20Custom%20Homes/emomedia.net-12.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366261/OnPoint%20Custom%20Homes/emomedia.net-13-1.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366256/OnPoint%20Custom%20Homes/emomedia.net-16.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBest Special Promotion for our playhouse partnership with Ronald McDonald\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366256/OnPoint%20Custom%20Homes/IMG_1779-768x512.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553366253/OnPoint%20Custom%20Homes/IMG_5247-e1495821597494-768x557.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eMany congrats and thanks to our awesome team for their hard work and success.\u003c/p\u003e\n","href":"/blog/new-awards-from-the-texas-association-of-builders/","link":"new-awards-from-the-texas-association-of-builders","objectID":"3ef2edadf5ecb30a9a44da6296803c40","title":"New Awards from the Texas Association of Builders","type":"post"},{"date":1533096000,"excerpt":"\u003cp\u003eAs you guys know, On Point makes it a point to support our community and give back both with time and charitable contributions. Throughout our history, we’ve worked with a variety of local and national organizations to give back in different ways. We have a longstanding history with Habitat for Humanity, Houston Food Bank and Candlelighters and last year had the amazing opportunity to work with the Ronald McDonald House of Houston to design + build a \u003ca href=\"https://onpointcustomhomes.com/blog/giving-back-ronald-mcdonald-playhouse/\"\u003ecustom playhouse\u003c/a\u003e for the residents of the home.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553365834/OnPoint%20Custom%20Homes/17201242_733044670203347_9198280239287779446_n.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eAs we grow each year, we ensure that our support for our community grows along with us. We are very excited to share that we’ve teamed up with the wonderful folks at \u003ca href=\"http://www.decmyroom.org/\"\u003eDec My Room\u003c/a\u003e to support children and families who are experiencing an extended stay in the Texas Medical Center.\u003c/p\u003e\n\u003cp\u003eWith one the world’s largest medical centers in our backyard, we want to do our part to support the families who have come from near and far and are calling the hospital home. Dec My Room’s mission is to create a healing place for those children and families by shopping and decorating a child’s hospital room in order to give them a personalized place to call home.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553365859/OnPoint%20Custom%20Homes/31237514_949650351876110_3490665813401745944_n.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eFounded right here in Houston, Dec My Room has since grown to support over 30 hospitals across nine states. The On Point \u003ca href=\"https://onpointcustomhomes.com/about-us/team/\"\u003eteam\u003c/a\u003e will be shopping and decorating hospital rooms throughout the year and we can’t wait!\u003c/p\u003e\n\u003cp\u003eIf you’re interested in volunteering with Dec My Room, they are always in search of kind-hearted people who have compassion for sick children and past volunteer experience. Click \u003ca href=\"http://www.decmyroom.org/to-volunteer.aspx\"\u003ehere\u003c/a\u003e to find out more!\u003c/p\u003e\n","href":"/blog/introducing-dec-my-room/","link":"introducing-dec-my-room","objectID":"ed52520ba447571044a433d105b30c54","title":"Introducing Dec My Room","type":"post"},{"date":1532404800,"excerpt":"\u003cp\u003eWindows play an important role in your home as their various styles, materials and colors will significantly impact the architectural \u003ca href=\"https://onpointcustomhomes.com/our-portfolio/\"\u003edesign\u003c/a\u003e and overall aesthetic. More importantly, they also are a significant piece of your home’s energy efficiency puzzle.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284973/OnPoint%20Custom%20Homes/Fargo-Dusk-1-e1526595343792.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eWith today’s \u003ca href=\"https://www.bizjournals.com/houston/news/2016/09/12/how-texas-new-energy-code-affects-houston.html?ana=e_me_set1\u0026amp;s=newsletter\u0026amp;ed=2016-09-12\u0026amp;u=qy6E2b6CZY7o5Zg0TAn1gMkklP3\u0026amp;t=1473692436\u0026amp;j=75752882\"\u003eenergy codes\u003c/a\u003e, all the windows going into our new homes are double paned with a gas insulation. We believe in going above and beyond minimum standards, so all of our windows use a high-grade performance low-e glass. Instead of a basic glass, we opt for a glass that is coated in a high-quality gas that has a reflective barrier to reduce temperature transfers. This makes your windows more energy efficient.\u003c/p\u003e\n\u003cp\u003eAdditionally, when homeowners want aluminum windows, we always recommend opting for a thermally broken window package, as it once again increases the energy efficiency of your house while significantly decreasing the chances of window sweat. With thermally broken windows, an additional protective barrier is installed in the window frame to mitigate thermal transfers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMaterial + Color\u003c/strong\u003e\u003cbr\u003e\nThe three most popular window materials are Aluminum, Vinyl and Wood-clad. Aluminum windows tend to be more modern in design as they have the thinnest profile. Aluminum windows also offer the most variety in color choices, but whatever color you choose it will be the same on the inside and outside.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553365553/OnPoint%20Custom%20Homes/Formal-Living-1.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eWith Vinyl windows you get a slightly thicker profile which makes them more commonly used on traditional style homes including farmhouse or craftsman styles. Vinyl also offers a fair amount of color choices for the exterior, but not as many as Aluminum. Typically, your interior color will be white despite the exterior color choice.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553358466/OnPoint%20Custom%20Homes/DSC_1782.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eLastly, Wood-Clad windows use wood on the interior, but still use a weather-resistant material for the exterior. With wood, you can have them painted or stained any color you want.\u003c/p\u003e\n\u003cp\u003e**Function\u003cbr\u003e\n**Not all windows function the same way and there are a variety of options for how you’d like your windows to operate.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553364979/OnPoint%20Custom%20Homes/Windows-e1531933620591.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eFixed glass or picture windows can’t be opened, but are installed solely for lighting.\u003c/p\u003e\n\u003cp\u003eSingle hung windows can be opened from the bottom, while the top remains stationary.\u003c/p\u003e\n\u003cp\u003eDouble hung windows open from both the top and the bottom in both directions. While not always drastically noticeable, double hung windows tend to have a slightly wider profile than single hung windows in order to allow the added functionality.\u003c/p\u003e\n\u003cp\u003eCasement windows swing open like a door and use a crank operating system. Casement windows are the most expensive of the various window styles, but usually our client’s most desired option.\u003c/p\u003e\n\u003cp\u003eAwning windows hinge at the top nd open outward like an awning.\u003c/p\u003e\n\u003cp\u003eBay windows add dimension to façade as they project outward creating a nook of space inside. They are great for adding a window seat for reading.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDesign\u003c/strong\u003e\u003cbr\u003e\nDepending on the architecture style of your home, the grid pattern of the window will change. We tend to install windows that have the grid pattern on the exterior of the glass rather than between the glass panes. Traditional homes usually feature windows with divided light grid patterns, while modern homes use grid-less uninterrupted light or minimal grid patterns. Window design is the easiest way to blend two architectural styles. Opting for a modern window package with a traditional architecture façade creates a transitional aesthetic and is one of the most popular design styles right now.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553364967/OnPoint%20Custom%20Homes/DSC_8535.jpg\" alt=\"\"\u003e\u003c/p\u003e\n","href":"/blog/basics-of-building-windows/","link":"basics-of-building-windows","objectID":"42f811a1c136447df9b20a00d80268b3","title":"Basics of Building: Windows","type":"post"},{"date":1531800000,"excerpt":"\u003cp\u003eToo often people are surprised to hear we offer in-house architectural design services in addition to building and remodeling. Not only do we offer architecture services, but we utilize a 3D design software that most residential teams don’t take advantage of. Designing all of our plans in 3D is a win-win for everyone involved as it brings a set of plans to life before an ounce of dirt is moved.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553364451/OnPoint%20Custom%20Homes/19e6b130-d246-464c-b06a-2d5eb22efd87.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eVisualize\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553364440/OnPoint%20Custom%20Homes/29d55e4c-6da4-49d7-a7e3-00ee43d9fd1a.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eFirst and foremost, visualization is the number one benefit of drawing plans in 3D. Using Revit, our architectural team is able to show you your home in 3D as they draw it. Not only do you get a more realistic image of the spatial layout of your floor plans, but you also get the benefit of seeing materials, colors and even lighting patterns in the space.\u003c/p\u003e\n\u003cp\u003eAdditionally, when changes are made you can see the update in real time creating an efficient way to design plans.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553364423/OnPoint%20Custom%20Homes/5a8a4f8d-7a83-4854-bea9-84951cb2665f.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSelect Materials\u003c/strong\u003e\u003cbr\u003e\nRevit allows us to quickly swap between various materials and colors to aid in the design process. For example, not sure if you want a siding or stucco exterior? We can show you both options in 3D with a few clicks of a button.\u003c/p\u003e\n\u003cp\u003eThe mock-ups are extremely accurate and give you a great visual of what to expect. We haven’t met anyone who doesn’t love the fact we can showcase how various materials will look in the finished product.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553364409/OnPoint%20Custom%20Homes/Screen-Shot-2018-07-12-at-11.55.19-AM.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCatch Errors\u003c/strong\u003e\u003cbr\u003e\nUnlike traditional drawing or less sophisticated software, Revit is extremely intuitive and automatically alerts you when conflicting issues arise. This helps us solve problems before they really become a problem.\u003c/p\u003e\n\u003cp\u003eCatching and resolving construction concerns during the design phase instead of running into them head-on in the field saves time and money. While not every mishap can be caught ahead of time, Revit has helped us drastically reduced the number of revisions needed during construction.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553364345/OnPoint%20Custom%20Homes/98137dcb-505b-4dad-bbab-33cc4d37c881-768x430.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003c!-- raw HTML omitted --\u003e\n","href":"/blog/designing-in-3d-why-it-makes-a-difference/","link":"designing-in-3d-why-it-makes-a-difference","objectID":"730417b8647d98fa7a698e17b6128fc5","title":"Designing in 3D Why it Makes a Difference","type":"post"},{"date":1531195200,"excerpt":"\u003cp\u003eProtecting your home from water is paramount to your home’s lifespan. Investing in products that protect against the inevitable water penetration can have lasting impacts on the longevity of your home. In this week’s Basics of Building series, we’re diving into water barrier protection plans with housewrap and rainscreens.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553363881/OnPoint%20Custom%20Homes/IMG_4382-e1530892758826.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eFirst up – Housewrap. To you it looks like we’ve wrapped your home in some fancy plastic cling wrap, but the reality is that cling wrap is your number one defense against water damage. Much like shopping in your local H-E-B, there are a slew of options for any product ranging in pricing and luxury. The same is true for Housewrap. At On Point, we believe in going to the extra mile and investing in quality product. It’s why we are proud to use \u003ca href=\"http://www.tamlyn.com/index.html\"\u003eTamlyn’s\u003c/a\u003e Drainable Housewrap, a unique product that removes at least 100 times more bulk water from a wall over standard housewraps. Additionally, their drainable housewrap drains two times faster than other’s on the market. It’s an added bonus that Tamlyn is a Houston-based company, started right in our backyard in Bellaire, TX.\u003c/p\u003e\n\u003cp\u003eLike mentioned earlier, we do everything in our power to create a strong water drainage plan so any moisture that gets caught between your façade material and the sheathing has a way to dry. It all starts with the housewrap that is applied to the exterior sheathing after framing is complete. It typically takes around 3-4 days to wrap the entire home and the wrap is installed from the bottom and works its way up. We then come back and flash the window openings sealing them off. Shortly after a home is wrapped and the window flashings are installed, we move on to installing windows and doors.\u003c/p\u003e\n\u003cp\u003eThe second phase of creating a solid drainage plan is the addition of a rainscreen. A rainscreen comes in a variety of shapes and styles and is used to add an additional layer of drainage between your façade material and your home. Check out this video from Construction Instruction on a rainscreen appliation.\u003c/p\u003e\n\u003c!-- raw HTML omitted --\u003e\n\u003cp\u003eWe install a rainscreen on all of our custom homes that have siding, stucco or stone in order to create airflow between the sheathing and siding material. It’s not needed for brick because the brick ledge creates a 6-inch air gap and additional weep holes provide enough ventilation on their own. Inevitably water will get through your siding material – thank you, Houston for the jungle-like humidity in the middle of the city! The rainscreen accelerates the drying process allowing for cross ventilation meaning airflow moves both vertically and horizontally to resolve the moisture.\u003c/p\u003e\n\u003cp\u003eWhile a rainscreen adds a costly line-item up front, it’s an investment that can sustain the longevity of your home. It’s one of the ways On Point sets our self apart from other builders, as we believe in going the extra mile when it comes to building science.\u003c/p\u003e\n\u003cp\u003eWe can’t stress enough how important waterproofing and protecting your home against moisture is. Don’t be afraid to ask what techniques and products your builder is using to help protect your home. Our project managers are ready and waiting to explain why and how we do the things we do when building your home!\u003c/p\u003e\n","href":"/blog/basics-of-building-housewrap-rainscreens/","link":"basics-of-building-housewrap-+-rainscreens","objectID":"7f3bd477243167d8e2faaadbd95ef953","title":"Basics of Building: Housewrap + Rainscreens","type":"post"},{"date":1530763200,"excerpt":"\u003cp\u003eLast week our Selections Coordinator extraordinaire, \u003ca href=\"https://onpointcustomhomes.com/personnel/tiffany-trask/\"\u003eTiffany\u003c/a\u003e, spent the week in Chicago learning all about two of our favorite appliance brands, Thermador and Bosch, newest luxury product lines. In fact, we love them both so much almost every home we build has one, if not both, in the appliance packages. Not only did Tiffany get a first look at the new products coming out this fall and beyond, but she also got some serious lessons in both steam oven and induction cooking, two trends that are taking off in kitchen design. We have so much knowledge to share, so let’s get to it.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553363177/OnPoint%20Custom%20Homes/IMG_6723-e1530570674581.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eLet’s all take a minute to be jealous of Tiffany’s trip to Chicago! An awesome group of Houston designers took the city by storm.\u003c/p\u003e\n\u003cp\u003eFirst things first, did you know that Thermador and Bosch are owned by the same company? And both companies believe in manufacturing products where they sell them, so 75% of the Bosch and Thermador appliances sold in America are actually made here, despite their German heritage. It’s probably because of their German heritage that both brands’ newest products feature a sleek European design, something we are so excited to share with clients.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553363166/OnPoint%20Custom%20Homes/IMG_6117-e1530571131810.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.thermador.com/collections\"\u003eThermador\u003c/a\u003e is giving all of their products a major overhaul! So big, that all their old designs are on the way out and you’ll only be able to order from the newly redesigned series starting this fall. Still named the Professional and Masterpiece Series, the new lines offer distinct styles—though both embody quality craftsmanship, incredible design, and exceptional innovation that Thermador is known for. And we’re not sure what we’re more stoked about, that the \u003ca href=\"http://www.thermador.com/trade/one-two-free\"\u003e1-2-FREE program\u003c/a\u003e isn’t going anywhere or the fact that their new lines can be installed flush-mount. #nerdybuilders, we know. We could talk all day about the new lines, but here are the highlights.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProfessional Series ranges will have large knobs and dials while the Masterpiece Series has a more contemporary design with sleek handles and touch controls.\u003c/li\u003e\n\u003cli\u003eThe new induction cooktops have the largest cooking capacity on the market. Speaking from experience, if you see induction cooking in action, you’ll be begging for a cooktop in no time. It’s why we’re so excited about the next piece of news…\u003c/li\u003e\n\u003cli\u003eNew ranges (coming in January 2019!) will offer a 2-burner induction top OR a drop-in steamer in-lieu of your griddle, so you get the both of best worlds in one!\u003c/li\u003e\n\u003cli\u003eThe new 30” steam + convection oven is the largest on the market and truly has superpowers when it comes to cooking your food in a whole new way! You can use each function on its own or combine for flexibility – think of a super moist chicken with a nicely browned skin.\u003c/li\u003e\n\u003cli\u003eWall ovens will now offer soft-close and some models will also have side-swinging door options.\u003c/li\u003e\n\u003cli\u003eSpeed ovens, another new super appliance that is growing in popularity, combines the power of convection cooking and microwave power to cook faster than ever before.\u003c/li\u003e\n\u003cli\u003eOur favorite Freedom Tower Fridges and Freezers now come in 36” columns and the wine towers have added a third zone. Cheers to that!\u003c/li\u003e\n\u003cli\u003eThe new Star Sapphire dishwasher now offers StarDry™ featuring zeolite, meaning no matter the material, it comes out dry! While ZeoLite is rolling out to Thermador first, new Bosch dishwashers will also get this feature.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553363148/OnPoint%20Custom%20Homes/IMG_6114-e1530571098538.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eSwitching gears to \u003ca href=\"https://www.bosch-home.com/us/\"\u003eBosch\u003c/a\u003e, they have some seriously cool new appliances that are making our team giddy with excitement, too! The Benchmark Series is the luxury line and features their FlexInduction with Power Move cooktop for one of the most innovative cooking experiences on the market. We’re still in awe of the power of the electromagnets that heat ONLY the pan leaving the cooktop cool to the touch the second you move the pan. Pure magic. The Power Move feature allows you to slide a pan, so it goes from boiling to simmer to warm without any knobs or buttons.\u003c/p\u003e\n\u003cp\u003eMore Bosch news that had us jumping for joy.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBosch has been leading the charge in smart appliances with its Home Connect, Alexa voice-activated control system. From appliance control to help with delivery and maintenance, Bosch’s Home Connect adds t experiential living.\u003c/li\u003e\n\u003cli\u003eThe new line of \u003ca href=\"https://www.bosch-home.com/us/experience-bosch/small-space-appliances\"\u003emicro appliances\u003c/a\u003e, between 18”-24” wide, are perfect for your mother-in-law suite, a game room or a garage apartment. It even features a 24” dryer that doesn’t need ventilation.\u003c/li\u003e\n\u003cli\u003eBosch is also introducing side-opening doors for their built-in ovens.\u003c/li\u003e\n\u003cli\u003eBlack Stainless Steel is a new finish option.\u003c/li\u003e\n\u003cli\u003eAgain, speed and steam ovens are taking off, and Bosch is not missing out on the trend. They offer combination options that have dual functions that can be used independently or combined for a more powerful cooking experience. We’re also pretty pumped about the flush-mount design which is perfect for a modern kitchen.\u003c/li\u003e\n\u003cli\u003eTheir dishwashers are the quietest on the market and have higher than Energy Star requirements. Additionally, the encapsulated base beneath the tub provides 24/7 leak protection from the automatic shutoff when a float switch activates.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553363130/OnPoint%20Custom%20Homes/IMG_6125-e1530571171184.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eWe could go on and on about all the new products and features. Have questions or want to learn more? Shoot us a note! We’ll be happy to geek out about appliances at any time or day.\u003c/p\u003e\n","href":"/blog/new-products-from-thermador-bosch/","link":"new-products-from-thermador-+-bosch","objectID":"72f54314528ead3c75c1d18958876de6","title":"New Products from Thermador + Bosch","type":"post"},{"date":1530504000,"excerpt":"\u003cp\u003eIn our final Foundation Fundamentals series, we’re talking about a foundation that is most commonly known to homeowners as a Pier and Beam foundation. We call it a Crawl-Space Foundation and use it most often when clients are in a floodplain and require an elevated home.\u003c/p\u003e\n\u003cp\u003e**Crawl-Space Foundation\u003cbr\u003e\n**For those of you who live in a floodplain (hello to our friends in Meyerland + Bellaire!) you need a Crawl-Space Foundation. This is a typical pier and beam foundation, which elevates the home leaving a crawl-space underneath. The space between the ground and the first floor can be as short as one-two feet or as tall as an entire story.\u003c/p\u003e\n\u003cp\u003eWhen constructing a crawl-space foundation, the first step is to drill piers and an exterior footing outlining the home. After your concrete footing is finished, a wall is built from the footing to the first-floor elevation height using CMUs, concrete masonry units that resemble cinderblocks. When building the CMU wall, we create leave-outs, rectangle holes allowing air to flow through for ventilation as well as water flow, if necessary, and the CMUs are later covered with your exterior façade material. Pressure treated wood beams attach to the piers to support the home and your subflooring is laid over the beams.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553362589/OnPoint%20Custom%20Homes/IMG_0605-e1529417317779.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003ePro: Similar to a Structural Slab with Builders Piers, the foundation stability is less threatened by soil shifts over time. Additionally, the house is protected from rising water and you have easier access to your plumbing.\u003c/p\u003e\n\u003cp\u003eCon: With a crawl space comes additional drainage needs to prevent standing water that can cause mold problems.\u003c/p\u003e\n\u003cp\u003eCompletion Timeline: 4 weeks\u003c/p\u003e\n\u003cp\u003eFoundation Fun facts:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe pour your driveway and sidewalks later, so they don’t get beat up during the rest of the construction process.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCatch up on everything you need to know about Structural Slab with Builders Piers and Post Tension Slabs in Part 1 and 2. Have questions about foundations? Give us a call! And stay tuned for more Building Science Breakdowns.\u003c/p\u003e\n","href":"/blog/basics-of-building-foundation-fundamentals-part-3/","link":"basics-of-building-foundation-fundamentals-part-3","objectID":"c1fd4d599b9599240105ec57820ade66","title":"Basics of Building: Foundation Fundamentals Part 3","type":"post"},{"date":1529985600,"excerpt":"\u003cp\u003eWe’re continuing the great debate of foundations with everything you need to know about a Post Tension Slab. Take a look at Part 1 of our Basics of Building series to learn more about building science and what we do differently from other builders.\u003c/p\u003e\n\u003cp\u003e**Post Tension Slab\u003cbr\u003e\n**If you are looking for a more cost-effective foundation, consider using a Post Tension Slab. In this technique, you eliminate the need for piers with the addition of beams and tension cables that provide extra stability. While many people assume a slab foundation is less stable, the reality is it’s still very secure and is a commonly used technique. We’ve constructed handfuls of homes using this technique.\u003c/p\u003e\n\u003cp\u003eThe first step for installing a post tension slab is to remove the original or native soil from the property and replace it with fill dirt. In Texas we have a lot of clay in our soil, which is prone to shifting, contracting or expanding which can cause foundation movement. In order to reduce the risk of movement, we remove the top layer of native soil and replace it with a more stable dirt. From there, we test the soil to ensure it is compacted properly before we start digging beams, typically in a grid pattern, and creating dirt pads. Both the pads and beam trenches are draped in a poly coating creating a protective barrier between the soil and your slab, safeguarding against moisture that can cause soil movement. Rebar and post tension cables are laid throughout providing stability for the slab. After inspections, your beams and foundation are poured, finished and begin to dry. With a post tension slab, you have to stay off the foundation for a minimum of seven days. After seven days, the cables are stressed tightening the foundation and squeezing any hairline cracks together.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553362376/OnPoint%20Custom%20Homes/IMG_2142-e1529337027315.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003ePro: Cost savings is the most common reason people opt for a post-tension slab.\u003c/p\u003e\n\u003cp\u003eCon: You are slightly more susceptible to settling if major soil shifts occur.\u003c/p\u003e\n\u003cp\u003eCompletion Timeline: 3 weeks\u003c/p\u003e\n\u003cp\u003eFoundation Fun facts:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIf you want your handprints in the foundation, make sure it’s in the garage so it doesn’t get covered up.\u003c/li\u003e\n\u003cli\u003eForm boards will form up any necessary drops in the slab for showers, elevators, garage, porch, back patio, etc. that need to be slightly lower than the rest of your flooring.\u003c/li\u003e\n\u003c/ul\u003e\n","href":"/blog/basics-of-building-foundation-fundamentals-part-2/","link":"basics-of-building-foundation-fundamentals-part-2","objectID":"5b52770f2e9f626b45f11561094b3f56","title":"Basics of Building: Foundation Fundamentals Part 2","type":"post"},{"date":1529380800,"excerpt":"\u003cp\u003eEver wonder exactly how your home is being put together – what techniques, products and systems are being used? And what makes one technique better than another? We’re breaking down the basics of building science to help you understand how your home is actually being constructed and sharing what we do differently from other builders. Without bogging you down with \u003cem\u003etoo\u003c/em\u003e much minutiae, we’ll explain various techniques and share the differences, pros and cons of each.\u003c/p\u003e\n\u003cp\u003eFirst things first, we’re tackling the great debate of foundations. There are many different ways to build a foundation and geographical circumstances will often dictate what can and can’t be used. Rest assured that whichever foundation you choose a structural engineer has signed off on the option!\u003c/p\u003e\n\u003cp\u003e**Structural Slab with Builders Piers\u003cbr\u003e\n**This is probably the most common foundation On Point uses when building houses and it is essentially a mash-up of a pier + beam and slab foundation because it combines deeply placed piers with a floating concrete slab. Instead of beams, you actually have a full concrete slab that sits on piers. Here’s how we do it and what you need to know about it!\u003c/p\u003e\n\u003cp\u003eOn Point uses Bell Piers, piers that bell out at the bottom adding an extra layer of stability, instead of the standard straight shaft pier. After the piers have been drilled, stabilized, poured and inspected, we lay down void boxes before pouring the slab. What’s a void box? The technical definition is a versatile and economical means of forming concrete, but in reality, it’s a fancy cardboard box we pour the concrete over. While this technique uses a slab of concrete, it’s different than a slab on grade (aka dirt) because the void boxes create a void of space between the foundation and the dirt. Over time the void boxes deteriorate allowing room for the soil beneath the foundation to expand and contract without it affecting your slab.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553361767/OnPoint%20Custom%20Homes/IMG_9370-e1529336481157.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003ePro: It is great for climates where frequent soil movement is common as the void space between the dirt and the slab provides flexibility, so your slab is less likely to endure damage from settling.\u003c/p\u003e\n\u003cp\u003eCon: Piers add cost, which makes this type of foundation more expensive than other options.\u003c/p\u003e\n\u003cp\u003eCompletion Timeline: Roughly 2 weeks\u003c/p\u003e\n\u003cp\u003eFoundation Fun Facts:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e1 cement truck is equal to 10 yards of concrete, so expect 15-30+ trucks lined up on foundation pour day.\u003c/li\u003e\n\u003cli\u003eCrazing in slabs, small hairline cracks up to the width of a quarter, is totally normal and does not affect the integrity of foundation, so don’t panic!\u003c/li\u003e\n\u003c/ul\u003e\n","href":"/blog/basics-of-building-foundation-fundamentals-part-1/","link":"basics-of-building-foundation-fundamentals-part-1","objectID":"6cb0e3fadc40cebd71beb9e6d5514542","title":"Basics of Building: Foundation Fundamentals Part 1","type":"post"},{"date":1528948800,"excerpt":"\u003cp\u003eWe recently hosted the most colorful backyard party anyone has ever seen with Ashley Rose from \u003ca href=\"https://onpointcustomhomes.us16.list-manage.com/track/click?u=b826ba5febe3133f70160f2c5\u0026amp;id=662bef0baf\u0026amp;e=f9fab88b77\"\u003eSugar \u0026amp; Cloth\u003c/a\u003e. While we didn’t do it alone, we did do something by ourselves before all the pool floats, balloon banners and yummy treats showed up – and that was design + build this pool and outdoor space for a family who loves to entertain. Thinking about updating your backyard space? Keep reading for our advice.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553361570/OnPoint%20Custom%20Homes/58963edc-ba69-4f2a-aea9-30d25d5b061a.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThings To Consider When Designing Your Backyard\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e1. What are your goals?\u003cbr\u003e\nFirst things first, you have to answer the question “how do I want to use my backyard?” Swimming, reading, grilling, putt-putting… How you plan on using the space will dictate the design and what special features you decide to add. Figure out what is most and least important to you and go from there. Keep in mind certain add-ons come with added costs + ongoing maintenance expenses.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553361557/OnPoint%20Custom%20Homes/Screen-Shot-2018-06-14-at-9.26.06-AM.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e2. Pool Layout + Features\u003cbr\u003e\nIf you opt for a pool, there are a variety of features you get to choose from. Saltwater vs chlorine, WiFi or remote control, heated, cooled, hot tub, wading area, water, light and fire features are just some of the options you can opt for when designing a pool. Additionally, the shape and layout are very important to coordinate with finish materials and decking, so we bring in experts to consult on your overall design to ensure it’s everything you want and more.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553361540/OnPoint%20Custom%20Homes/Screen-Shot-2018-06-14-at-9.27.17-AM-1.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e3. Grill Baby Grill\u003cbr\u003e\nIf you like to cook and grill-out, there are a variety of ways to incorporate an outdoor kitchen into your backyard. You can add a full built-in summer kitchen complete with a built-in grill, sink, prep space and additional outdoor appliances. If you want more flexibility in the space, we’re seeing more homeowners opt for a multi-use island and stand-alone grills or Green Eggs.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553361526/OnPoint%20Custom%20Homes/3df0d20f-835d-4481-a2a8-5a2a5abcf92e.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553361511/OnPoint%20Custom%20Homes/67d4ab23-5e05-4d10-aa08-c5fac0bbad25.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e4. To Turf or not to Turf\u003cbr\u003e\nNothing says luxury like perfectly trimmed, bright green grass all year long with no green thumb or lawnmower required. If you want to win yard of the month, consider installing turf instead of traditional grass sod. It comes in a variety of textures so you can get the perfect aesthetic and with weed resistant layers and water drainage system, it’s a breeze to maintain. Plus, it’s kid and pet-friendly and nearly impossible to tell it’s not real grass.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553361483/OnPoint%20Custom%20Homes/Screen-Shot-2018-06-14-at-9.30.28-AM.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e5. Where to Gather\u003cbr\u003e\nYou’ve heard us say indoor-outdoor living is a trend that is here to stay, so it’s no surprise we urge clients to consider a covered seating area. With Houston sun, having a covered place to sit down and enjoy a glass of wine is a must. From outdoor dining tables to porch swings and comfy couch seating, make sure you have enough room to gather together. This is especially true if you like to entertain. It’s always an added bonus if you work in a fireplace (gas or wood-burning) and a TV + speaker entertainment set up, too!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553361458/OnPoint%20Custom%20Homes/ea49c73f-18c5-4e47-9ace-bc3c24d29621.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eMany thanks to Sugar + Cloth for decorating and styling this backyard for a perfect summer get together. Check out Ashley’s \u003ca href=\"https://onpointcustomhomes.us16.list-manage.com/track/click?u=b826ba5febe3133f70160f2c5\u0026amp;id=de5b89d2d1\u0026amp;e=f9fab88b77\"\u003eblog\u003c/a\u003e for tips on hosting an epic summer pool party as colorful as this one. \u003cem\u003eAll Photos are courtesy of Sugar + Cloth and Carrie C.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eLearn more about On Point Custom Homes \u003ca href=\"https://onpointcustomhomes.us16.list-manage.com/track/click?u=b826ba5febe3133f70160f2c5\u0026amp;id=5e2933ebc5\u0026amp;e=f9fab88b77\"\u003eDesign + Build\u003c/a\u003e process and browse our different design styles today!\u003c/p\u003e\n","href":"/blog/the-perfect-party-ready-backyard/","link":"the-perfect-party-ready-backyard","objectID":"44d614c067023c4be3dc16924d0bea42","title":"The Perfect Party Ready Backyard","type":"post"},{"date":1527652800,"excerpt":"\u003cp\u003eWe recently completed a modern farmhouse in Oak Forest that may be one of our favorite projects this year! The home started as an inventory home but was purchased mid-construction turning the adorable 4 bedroom, 3.5 bath family home into a semi-custom job. With modern farmhouse style continuing to grow in popularity, take a look below for tips from our team on capturing this style.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFive Tips for Achieving the Modern Farmhouse Look…\u003c/strong\u003e\u003cbr\u003e\n\u003cstrong\u003eEmbrace Wood\u003c/strong\u003e\u003cbr\u003e\nWhile incorporating wood is no new trend when it comes to farmhouse design, think beyond wood beams. From barn doors to floating shelves and butcher block counters, wood warms the space and the natural grains will compliment one another making the space more dynamic. We opted for a Weathered Oak and Country White floor stain and clear stained walnut floating shelves. A farmhouse wouldn’t be complete without some shiplap, so we wrapped the fireplace and installed a shiplap accent wall in the study. Additionally, the beadboard on the entry ceiling was a nice compliment to the shiplap and added another layer of texture to the space.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553358570/OnPoint%20Custom%20Homes/Screen-Shot-2018-05-29-at-5.09.38-PM.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMix Your Metals\u003c/strong\u003e\u003cbr\u003e\nModern farmhouse sets itself apart from the classic farmhouse style by blending various styles, so it shouldn’t come as a surprise that we recommend mixing metals with hardware, lighting and more. Sleek matte black cabinet pulls added some drama to the traditional shaker style cabinetry and complimented the metal light fixtures throughout. Additionally, we added touches of brass and gold with the sink faucet and accent lighting to bring in some Southern flair. Lastly, the black iron stair railing brought a truly modern element to the traditional living room.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553358552/OnPoint%20Custom%20Homes/Screen-Shot-2018-05-29-at-5.10.45-PM.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLayer Lighting\u003c/strong\u003e\u003cbr\u003e\nLight fixtures make a huge impact on the space as they bring so much personality to a room. We brought in light fixtures that had both industrial and antique inspiration, many of which featured exposed bulbs or glass elements. Mounted accent lighting highlighted the floating shelves in the kitchen and bar nook and the black metal art lighting in the study brought even more flair to the shiplap accent wall.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553358539/OnPoint%20Custom%20Homes/Screen-Shot-2018-05-30-at-8.18.50-AM.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eComfort Colors\u003c/strong\u003e\u003cbr\u003e\nWhites and grays are still very much in; however, when designing a modern farmhouse, we suggest opting for more antique colors that bring in warmth and comfort. We choose Sherwin Williams Alabaster for all of the ceilings, doors and trim as it has a warm tone. On The Rocks was used on all the first-floor interior walls, which allowed the Blustery Sky blue kitchen cabinets to shine. In the master bathroom, Classic French Gray cabinets paired with Stardew blue walls. The white and blue paint was consistent on the exterior with Alabaster board and batten and lap siding and a light blue front door and patio ceiling.\u003cbr\u003e\n**\u003cbr\u003e\n\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553358524/OnPoint%20Custom%20Homes/bec0df8d-1204-4742-9966-34cd61e83c0c.jpg\" alt=\"\"\u003e**\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFunction is Beauty\u003c/strong\u003e\u003cbr\u003e\nThe key to farmhouse living is function and practicality. Open concept living, kitchen and dining, along with thoughtful cabinetry designs, elevate the usability of a space and provide seamless flow for entertaining and everyday family life. Similarly, a large apron-front farmhouse sink provides beauty and purpose, while built-in storage hides clutter and creates a focal point for the room.\u003cbr\u003e\n\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553358504/OnPoint%20Custom%20Homes/Screen-Shot-2018-05-30-at-8.25.42-AM.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eIn addition to our tips to pulling off modern farmhouse design, there are endless other ways to balancing classic comfort and modern touches to bring your farmhouse vision to life. Learn more about On Point Custom Homes \u003ca href=\"http://www.topbuildersolutions.net/clickthrough.aspx?rurl=https://onpointcustomhomes.com/about-us/design-build/\u0026amp;cid=\u0026amp;ecid=23957\"\u003eDesign + Build\u003c/a\u003e process and browse our different design styles today!\u003c/p\u003e\n","href":"/blog/bringing-together-the-perfect-modern-farmhouse-design/","link":"bringing-together-the-perfect-modern-farmhouse-design","objectID":"dd0c060592dfcaeff9ace32a401667c5","title":"Bringing Together the Perfect Modern Farmhouse Design","type":"post"},{"date":1523419200,"excerpt":"\u003cp\u003eIn our final reveal of this major remodel project, we’re talking all about the outdoors. With spring weather in full swing, you’ll be daydreaming about this stunning exterior transformation for days.\u003c/p\u003e\n\u003cp\u003eWithout altering the architecture of the existing home, we modernized the facade with a fresh coat of paint. We removed the shutters and opted for a clean transitional aesthetic. The doors remained the same; however, they also received new paint. We used a high gloss black paint on the front door and white for the french doors off the study and the garage door.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553358004/OnPoint%20Custom%20Homes/15.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284797/OnPoint%20Custom%20Homes/DSC_8608.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553358038/OnPoint%20Custom%20Homes/DSC_8612.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eThe backyard may have had one of the largest transformations as we torn out all the existing landscaping and water fountain to make way for all new turf, landscaping and new covered entertaining area complete with a TV, surround sound, wood-burning fireplace and ample seating. The Carolina blue ceiling paint brings a southern elegance to this flexible living space.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553358052/OnPoint%20Custom%20Homes/16.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284795/OnPoint%20Custom%20Homes/DSC_8602.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284791/OnPoint%20Custom%20Homes/DSC_8581.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357953/OnPoint%20Custom%20Homes/DSC_8584.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eDid you miss \u003ca href=\"https://onpointcustomhomes.com/blog/briargrove-southern-charm-remodel-part-1/\"\u003ePart 1\u003c/a\u003e, \u003ca href=\"https://onpointcustomhomes.com/blog/briargrove-southern-charm-remodel-part-2/\"\u003ePart 2\u003c/a\u003e and \u003ca href=\"https://onpointcustomhomes.com/blog/briargrove-southern-charm-remodel-part-3/\"\u003ePart 3\u003c/a\u003e of this whole-home remodel? Click through to see the main living spaces, bedrooms and bathrooms!\u003c/p\u003e\n","href":"/blog/briargrove-southern-charm-remodel-part-4/","link":"briargrove-southern-charm-remodel-part-4","objectID":"49e751d174a02d801ddf4fad88c8322a","title":"Briargrove Southern Charm Remodel: Part 4","type":"post"},{"date":1522814400,"excerpt":"\u003cp\u003eIn case you missed the first two posts about this Briargrove whole-home remodel, take a look \u003ca href=\"https://onpointcustomhomes.com/blog/\"\u003ehere\u003c/a\u003e! When we took on this project the overall layout of the home did not need many changes; however, the finishes were ready for some updates. In this week’s series, we’re sharing the before and afters of the bedrooms and bathrooms. The home featured a kid’s study nook with built-ins that we ripped out in order to transform the space for added functionality for a nursery.\u003c/p\u003e\n\u003cp\u003eAll new paint, fresh stain on the hardwood floors, new hardwood floors replaced old carpet and all new countertops, hardware, light fixtures and more throughout. We also added two wallpaper accent walls to elevate the interior design and personalize the space.\u003c/p\u003e\n\u003cp\u003eTake a look at the Master Suite transformation and all the secondary bedrooms and bathrooms. Love marble, you’ll fall in love with these spa-like spaces.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284706/OnPoint%20Custom%20Homes/7.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357298/OnPoint%20Custom%20Homes/DSC_8361-768x513.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357380/OnPoint%20Custom%20Homes/DSC_8308.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357393/OnPoint%20Custom%20Homes/DSC_8315-1.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357411/OnPoint%20Custom%20Homes/12.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357423/OnPoint%20Custom%20Homes/DSC_8323-768x513.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357436/OnPoint%20Custom%20Homes/11.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357452/OnPoint%20Custom%20Homes/8.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357463/OnPoint%20Custom%20Homes/9.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357479/OnPoint%20Custom%20Homes/DSC_8370-1.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357501/OnPoint%20Custom%20Homes/13.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357516/OnPoint%20Custom%20Homes/DSC_8431-1.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357530/OnPoint%20Custom%20Homes/10.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553357544/OnPoint%20Custom%20Homes/14.jpg\" alt=\"\"\u003e\u003c/p\u003e\n","href":"/blog/briargrove-southern-charm-remodel-part-3/","link":"briargrove-southern-charm-remodel-part-3","objectID":"950c93f26edab66b464f3a6861685140","title":"Briargrove Southern Charm Remodel: Part 3","type":"post"},{"date":1522209600,"excerpt":"\u003cp\u003eWho doesn’t love a kitchen makeover?! This Briargrove home had a good footprint but needed some remodel love to make the room feel more timeless. On Point resurfaced the entire room to transform this family’s kitchen from drab to fab.\u003c/p\u003e\n\u003cp\u003eAll new paint, countertops, hardware, lighting, and sink + faucet goes a long way! Take a look at the final product below.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284703/OnPoint%20Custom%20Homes/6.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553356518/OnPoint%20Custom%20Homes/DSC_8524.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553356653/OnPoint%20Custom%20Homes/DSC_8549.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553356613/OnPoint%20Custom%20Homes/DSC_8553.jpg\" alt=\"\"\u003e\u003cbr\u003e\n\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553356557/OnPoint%20Custom%20Homes/DSC_8559.jpg\" alt=\"\"\u003e\u003c/p\u003e\n","href":"/blog/briargrove-southern-charm-remodel-part-2/","link":"briargrove-southern-charm-remodel-part-2","objectID":"a63eaad89644289433765826704d51d8","title":"Briargrove Southern Charm Remodel: Part 2","type":"post"},{"date":1521604800,"excerpt":"\u003cp\u003eOn Point is known for our custom \u003ca href=\"https://onpointcustomhomes.com/about-us/design-build/\"\u003edesign + build\u003c/a\u003e program; however, we also love helping clients transform their existing home with major \u003ca href=\"https://onpointcustomhomes.com/remodels/\"\u003eremodel\u003c/a\u003e projects! In this three-part series, we’re showing you the before and afters of this Briargrove home that needed a major facelift.\u003c/p\u003e\n\u003cp\u003eOn Point took on the challenge of updating this house without altering the overall footprint. We did update every surface, fixture and finish for the entire interior and exterior and came back and added a freestanding outdoor entertaining space complete with a wood-burning fireplace, surround sound, TV and ample seating. In Part 1, take a peek at the main living spaces.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEntry + Stairs\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe replaced the tile with stunning black and white marble tile for a dramatic entry and added wainscoting for added texture in the space.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284704/OnPoint%20Custom%20Homes/1.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eStudy\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe transformed the previous formal sitting room into a masculine study and office. We painted the box-beams on the ceiling and added built-in bookcases and a built-in desk. New dark hardwood floors replaced the old tile flooring.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284704/OnPoint%20Custom%20Homes/3.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDining Room\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNew dark hardwood floors carried through into the dining room which also received a fresh coat of paint and new gold and glass chandelier.\u003cbr\u003e\n**\u003cbr\u003e\n\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284702/OnPoint%20Custom%20Homes/2.jpg\" alt=\"\"\u003e**\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLiving Room\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the living room, the existing hardwood floors were restained a darker brown and new built-ins with Emtek hardware were added on either side of the resurfaced white brick fireplace. The glass doors leading into the backyard were painted white and the ceiling fan was removed.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284705/OnPoint%20Custom%20Homes/4.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eStay tuned for next week’s post to check out the kitchen!\u003c/p\u003e\n","href":"/blog/briargrove-southern-charm-remodel-part-1/","link":"briargrove-southern-charm-remodel-part-1","objectID":"0cee67060738b57a24c5606620cd6adb","title":"Briargrove Southern Charm Remodel: Part 1","type":"post"},{"date":1520226000,"excerpt":"\u003cp\u003eWho runs the world? Girls! It’s officially National Women in Construction Week and we’re celebrating the fabulously talented ladies in the office! If you haven’t had the pleasure of working with them yet, you can get to know them a bit better below!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553355759/OnPoint%20Custom%20Homes/WIC.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eOur Selections Coordinator, \u003ca href=\"https://onpointcustomhomes.com/personnel/tiffany-trask/\"\u003eTiffany,\u003c/a\u003e has been in the industry for more than 18 years and with us for more than 10! She is the third generation in her family to pursue a career in the \u003ca href=\"https://onpointcustomhomes.com/current-homes/\"\u003eHouston construction industry\u003c/a\u003e. Her career began on the commercial side in the accounting department of her father’s company. In this role, she built her foundation on construction elements and timeline from the inside out. After deciding to pursue her interest the residential construction field, Tiffany proceeded to work for a custom builder and land development company where she found her strengths best suited to assist both the Project Management and Accounting departments.\u003c/p\u003e\n\u003cp\u003eSince joining the On Point team in early 2008, she has assisted the team in any way possible from maintaining budgets to property management, product research and now is our designer extraordinaire helping clients with all of their selection choices! She has the Sherwin Williams paint colors memorized and can find you the perfect fixtures, faucets and more.\u003c/p\u003e\n\u003cp\u003eFrom design selections to architectural plans, \u003ca href=\"https://onpointcustomhomes.com/personnel/maria-mast/\"\u003eMaria\u003c/a\u003e, is another one of our leading ladies. As a Sr. Architectural Designer she brings our clients vision to life. Before moving into the residential field with On Point in 2016, Maria worked at some notable commercial firms honing her skills in space planning and interior design. All of our clients rave about her amazing ability to transform their ideas and create a unique home that is not only functional, but also incredibly beautiful.\u003c/p\u003e\n\u003cp\u003eA newer addition to the On Point team, our Marketing Director \u003ca href=\"https://onpointcustomhomes.com/personnel/ashley-tucker/\"\u003eAshley\u003c/a\u003e, takes her passion for all things communication to make sure we’re staying ahead of the marketing curve. Her ability to juggle multiple projects and keep everything on track is something we all admire. She’s worked with a multitude of local and national businesses helping them reach their business goals through integrated strategies and is constantly making improvements to our sales and operations processes. You won’t find her without her t0-do list and colored coded pens in hand!\u003c/p\u003e\n\u003cp\u003eLast, but certainly not least, our amazing Office Manager \u003ca href=\"https://onpointcustomhomes.com/personnel/carmen-spruill/\"\u003eCarmen\u003c/a\u003e, keeps us all going! Carmen not only handles all of our accounts payables and receivables, but she makes amazing contributions behind the scenes across all departments. Her invaluable organizational and management skills have earned her the title of “Office Mom”, and she works hard every day to keep the team in line! After five amazing years with On Point, we can’t imagine the office without her!\u003c/p\u003e\n\u003cp\u003eWe raise a glass to the amazing women at On Point and all the strong, hardworking women across the entire construction industry today and everyday!\u003c/p\u003e\n","href":"/blog/national-women-construction-week/","link":"national-women-in-construction-week","objectID":"78bbcc2e5ec5a97fcd49c5f6765d2cc7","title":"National Women in Construction Week!","type":"post"},{"date":1519189200,"excerpt":"\u003cp\u003eLocated in the heart of Meyerland, this brand new custom home was designed and built five feet off the ground after our clients endured not one, but two floods in their prior one-story ranch.\u003c/p\u003e\n\u003cp\u003eAfter purchasing and remodeling the home, the home was stuck in the 2015 Memorial Day flood. They reached out to On Point shortly after looking for guidance on whether a second remodel or a complete rebuild made the most sense. During that discussion, the home was once again compromised during the 2016 Tax Day flood and they quickly decided rebuilding and going up was the way to go!\u003c/p\u003e\n\u003cp\u003eOn Point designed and built this home with a raised elevation five feet off the ground and the home escaped the record-setting waters of Harvey.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTake a look at the finished space below!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284761/OnPoint%20Custom%20Homes/DSC_3599.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284762/OnPoint%20Custom%20Homes/DSC_3643-1.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284762/OnPoint%20Custom%20Homes/DSC_3662.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284761/OnPoint%20Custom%20Homes/DSC_3584.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553355423/OnPoint%20Custom%20Homes/DSC_3566.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284760/OnPoint%20Custom%20Homes/DSC_3544.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553355486/OnPoint%20Custom%20Homes/DSC_3524-1.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFOR MORE PHOTOS AND PRODUCT INSIGHT, CHECK OUT\u003c/strong\u003e \u003ca href=\"http://www.topbuildersolutions.net/clickthrough.aspx?rurl=https://www.houzz.com/projects/2910362/elevated-meyerland-modern\u0026amp;cid=1099367\u0026amp;ecid=23113\"\u003e\u003cstrong\u003eHOUZZ\u003c/strong\u003e\u003c/a\u003e\u003cstrong\u003e.\u003c/strong\u003e\u003c/p\u003e\n","href":"/blog/2015-2016-flood-victims-rebuild-meyerland-modern-5-feet/","link":"2015-+-2016-flood-victims-rebuild-meyerland-modern-5-feet-up","objectID":"63872130a2bf7555e4f823c36c5dbaac","title":"2015 + 2016 Flood Victims Rebuild Meyerland Modern 5 Feet Up","type":"post"},{"date":1517806800,"excerpt":"\u003cp\u003eTrend alert – the smart home is getting even smarter! In this week’s blog post, we’re sharing some of the smartest and techy savvy products we discovered at the International Builder Show.\u003c/p\u003e\n\u003cp\u003eWhether you are \u003ca href=\"https://onpointcustomhomes.com/about-us/design-build/\"\u003ebuilding\u003c/a\u003e or \u003ca href=\"https://onpointcustomhomes.com/remodels/\"\u003eremodeling\u003c/a\u003e, technology is becoming more accessible in price and easier to install and integrate throughout your house. The number one trend in smart technology is peace-of-mind. Products that allow homeowners to monitor their space and control it from afar seem to be the number one driver in innovation. Additionally, technology continues to get smarter and more integrated which is creating a transition from devices that only react, to devices that listen, learn, diagnose and problem solve on their own.\u003c/p\u003e\n\u003cp\u003eWe continue to see voice activated as well as motion-sensored devices dominate the space. We visited with Kwikset Locks to test their new Apple Home compatible smart lock. Not only can you get into your house with a customized code, but you can open the door with voice-command from Siri and lock and unlock through the app.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280849/OnPoint%20Custom%20Homes/Kwikset-915-Touchscreen-Electronic-Deadbolt-15.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eSmart thermostats like Ecobees and Nests are still one of the top smart devices in homes and are becoming even more compatible with Alexa and Google Home integration. At Monogram appliances, we learned about their smart fridge and freezers that have smart drawers that can be set to defrost mode and then transition back to freezer mode if they aren’t opened within a certain time window to minimize food lose.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280838/OnPoint%20Custom%20Homes/ecobee3lite_2x_42057d11-e636-4a87-b105-8fa4c4dad4cb-768x537.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eSteam ovens and speed ovens are rising in popularity and many appliance brands now have apps that allow homeowners to register the product, get alerts when maintenance is needed and monitor/control from an app or voice activation.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280823/OnPoint%20Custom%20Homes/blog-21-768x479.png\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eFor example, we love Lutron’s Casada lighting which allows you to pair lighting, speakers and even window coverings to set “Scenes” for your home. Imagine saying “Alexa, set morning scene” and your shades open, bedroom and bathroom lights come on and good morning playlist starts playing. From morning to party scenes, these pre-set scenes create an amazing experience for the homeowner.\u003c/p\u003e\n\u003cp\u003eThese are just a handful of our favorite new technology trends. Goodbye are the days of hiring a specialist to integrate your home with cool tech devices. It’s so easy you can do it all yourself now!\u003c/p\u003e\n","href":"/blog/design-trends-straight-international-builder-kitchen-bath-show-part-3/","link":"design-trends-straight-from-the-international-builder-kitchen-+-bath-show-part-3","objectID":"ff83e4a2a41ce3573fbb76d2e569b8eb","title":"Design Trends Straight from the International Builder, Kitchen + Bath Show: Part 3","type":"post"},{"date":1517202000,"excerpt":"\u003cp\u003eIn Part II of our IBS design trends blog series, we’re sharing the feedback and highlights surrounding your home’s finishes. From countertop and tile materials to sinks and faucets, here’s what to expect in 2018.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280454/OnPoint%20Custom%20Homes/IMG_4286-768x1024.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280435/OnPoint%20Custom%20Homes/Photo-Jan-10-9-01-43-AM-768x576.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eStarting in the Kitchen, the number one trend in cabinet layout and design is the use of open shelving. More homeowners are opting for a dedicated “messy” prep space (more insight in \u003ca href=\"https://onpointcustomhomes.com/blog/design-trends-straight-international-builder-kitchen-bath-show-part-1/\"\u003ePart 1\u003c/a\u003e), and with the introduction of this luxury pantry, the added storage space eliminates the need for a lot of upper cabinetry in your main kitchen. By removing upper cabinets, you create a cleaner, sleek aesthetic in your kitchen and bath spaces. Additionally, less upper cabinetry means you are able to incorporate more windows into those spaces as well.\u003c/p\u003e\n\u003cp\u003eUnder island storage and lower cabinets are still very much here to stay; however, they too are getting a makeover. Many homeowners are opting to install drawers instead of traditional shelves and doors. This transition from traditional cabinetry to drawer storage allows for easier aging in space as your storage becomes more functional and easier to access.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280411/OnPoint%20Custom%20Homes/IMG_5538-768x576.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eWhen it comes to countertop options, high gloss finishes may be on the way out as honed finishes seem to be the newest trend in countertops. We expect to see more natural and softer finishes on countertops as it helps warm up the space. Geometric and encaustic patterned tile is also on trend, especially as feature walls in bathrooms and utility rooms. Textured tile is still a popular choice, especially wood-look tile as it helps warm up a space with natural hues.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280388/OnPoint%20Custom%20Homes/IMG_5578-768x1024.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280364/OnPoint%20Custom%20Homes/IMG_5490-768x1024.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eLastly, we saw hundreds of new sink and faucet options and multifunction sinks that include cutting boards, drying racks and additional workspace options were a focus as they continue to rise in popularity. Many brands are even reworking the traditional drainage feature turning it into a design element that elegantly hides your disposal and drains. We saw a variety of beautiful facet options including smart facets with touch activated sensors or splash-guard water flows as well as chrome, matte black and even silicone finishes in thousands of different shapes, sizes and functions.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280319/OnPoint%20Custom%20Homes/IMG_5498-768x1369.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280292/OnPoint%20Custom%20Homes/IMG_5511-768x1024.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553280265/OnPoint%20Custom%20Homes/IMG_5579-768x1024.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eThat’s a wrap for now. Next week we’re diving into all things tech as the smart home continues to evolve.\u003c/p\u003e\n","href":"/blog/design-trends-straight-international-builder-kitchen-bath-show-part-2/","link":"design-trends-straight-from-the-international-builder-kitchen-+-bath-show-part-2","objectID":"152957df1c67e4351b4c4e8f39922eb0","title":"Design Trends Straight from the International Builder, Kitchen + Bath Show: Part 2","type":"post"},{"date":1516338000,"excerpt":"\u003cp\u003eAt \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e, we truly believe in exploring new ideas and staying ahead of the curve when it comes to \u003ca href=\"https://onpointcustomhomes.com/about-us/design-build/\"\u003earchitectural design\u003c/a\u003e, product integration, and building science. We make it a point to attend a variety of industry shows across the county throughout the year in order to keep our \u003ca href=\"https://onpointcustomhomes.com/about-us/team/\"\u003eteam\u003c/a\u003e apart of conversations in the building space and in front of the latest and greatest products. Most recently our \u003ca href=\"https://onpointcustomhomes.com/personnel/john-legget/\"\u003eCEO\u003c/a\u003e, \u003ca href=\"https://onpointcustomhomes.com/personnel/earl-correll/\"\u003ePresident\u003c/a\u003e, \u003ca href=\"https://onpointcustomhomes.com/personnel/tiffany-trask/\"\u003eSelections Coordinator\u003c/a\u003e, \u003ca href=\"https://onpointcustomhomes.com/personnel/garrett-nance/\"\u003ePurchasing Manager\u003c/a\u003e and \u003ca href=\"https://onpointcustomhomes.com/personnel/ashley-tucker/\"\u003eMarketing Director\u003c/a\u003e took a trip to Orlando to attend the National Association of Home Builders International Builder Show as well as the Kitchen and Bath Show.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553285020/OnPoint%20Custom%20Homes/IMG_5507-1400x1050.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553285018/OnPoint%20Custom%20Homes/IMG_5556-768x576.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eDuring our week-long trip, the team attended a variety of education panels, spoke with a variety of product reps and explored new design trends to see where the industry is headed in 2018 and beyond. One of the largest conversations and running themes during the conference was the idea of going back to old times. Today’s homeowners are looking for a home that provides the ultimate user experience in a welcoming and warm space.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553285018/OnPoint%20Custom%20Homes/IMG_5491-768x576.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eThat means hiding the technology, reintroducing warmer tones alongside your whites and grays, and making your spaces more multipurpose. When it comes to paints and finishes, gray is here to stay; however, more tans and beiges are being incorporated into the home. Additionally, softer more honed finishes, as well as wood accents, are being used more frequently to bring the ambiance to the outside indoors. Expect to see more concrete or matte countertops in lieu of high gloss options. Mixing metals are also still on trend with gold and champagne finishes being installed with silver, bronze, and black hardware or lighting.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553285019/OnPoint%20Custom%20Homes/IMG_5585-768x576.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eOne of our favorite trends from the show is the idea of hiding messy areas in order to create a clean and relaxing space. For example, people are opting to hide all their technology instead of showcasing it like they used to. Hidden speakers, tech cubbies and dedicated drawers for charging stations and hidden outlets are becoming the norm. Lots of people are opting for paneling their appliances, so their dishwashers, fridges, and ice-makers blend in with the traditional cabinetry. Additionally, the “messy kitchen” or luxury pantry is being worked into floorplans as dedicated space for small appliances such as microwaves, coffee bars, and even dishwashers. This expanded pantry space allows for a dedicated messy prep area as well as extra storage, so your main kitchen area remains clean and sleek.\u003c/p\u003e\n\u003cp\u003eStay tuned for more insight on some of our favorite trends and products!\u003c/p\u003e\n","href":"/blog/design-trends-straight-international-builder-kitchen-bath-show-part-1/","link":"design-trends-straight-from-the-international-builder-kitchen-+-bath-show-part-1","objectID":"2611348aa858535ac7152263e083fa75","title":"Design Trends Straight from the International Builder, Kitchen + Bath Show: Part 1","type":"post"},{"date":1373601600,"excerpt":"\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284757/OnPoint%20Custom%20Homes/DSC_3221-778095.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://res.cloudinary.com/onpointcustomhomes/image/upload/v1553284976/OnPoint%20Custom%20Homes/GHBA-Houstons-Best-2009-Earl-778332.jpg\" alt=\"\"\u003e\u003c/p\u003e\n\u003cp\u003eOn Point Custom Homes is proud to share the news of our 2009 GHBA award for Houston’s Best Custom Home Elevation for our recently completed design at 2246 Branard!! Earl recently accepted this award on 9/12/09 at a formal event hosted by the GHBA. We are truly excited and honored to be the 2009 recipient of this prestigious local award!\u003c/p\u003e\n","href":"/blog/ghba-best-custom-home-elevation-winner/","link":"ghba-best-custom-home-elevation-winner","objectID":"a8eb5131b5c0827168372c4d570c0290","title":"GHBA Best Custom Home Elevation Winner","type":"post"},{"date":1371873600,"excerpt":"\u003c!-- raw HTML omitted --\u003e\n\u003cp\u003eReview of our latest smarthome at 2424 Hazard by KTRH connected reporter, Michelle Merhar!\u003c/p\u003e\n","href":"/blog/2424-hazard-review/","link":"2424-hazard-review","objectID":"3c8ff43faa0cd28e8c30f79d77d195ee","title":"2424 Hazard Review","type":"post"},{"date":1365739200,"excerpt":"\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes \u003c/a\u003econsiders itself one of the pioneers of Houston modern homes. Our first modern Houston home was in 2005 when very few competitors would venture into this realm. We have seen a demand for our Houston modern homes grown over the years and field many calls for both our inventory homes as well as custom homes. If you wish to schedule a consultation with one of our staff regarding a custom home, please call \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e at 713-600-2422.\u003c/p\u003e\n","href":"/blog/do-you-build-modern-homes-in-houston/","link":"do-you-build-modern-homes-in-houston","objectID":"fcd7fcb2fe16bec9011e24122465e943","title":"Do you build modern homes in Houston?","type":"post"},{"date":1363492800,"excerpt":"\u003cp\u003eWe are asked this question with more and more regularity. \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e is proud to have a staff member, Earl Correll, who has earned his certified green professional (CGP) designation through the National Association of Home Builders (NAHB). Through this designation, we are able to provide valuable insight to our custom home clients that wish to adopt green principles into their home. Also, we strive to add green building techniques into our inventory homes as we find environmentally friendly products that can enhance both our quality and finished product.\u003c/p\u003e\n","href":"/blog/does-on-point-custom-homes-use-green-building/","link":"does-on-point-custom-homes-use-green-building","objectID":"5c8f97df566cd4613328f5e33bb91bfb","title":"Does On Point Custom Homes use green building?","type":"post"},{"date":1359867600,"excerpt":"\u003cp\u003eWe all know about the Houston, TX heat!! The primary reason to install a radiant barrier is reduce heat gain in the Summer and heat loss in the Winter. This is accomplished by reflecting the suns rays back toward the actual roof and not allowing them fully to penetrate the attic space.\u003c/p\u003e\n\u003cp\u003eThere are many different applications for radiant barriers in residential attics. On new construction custom homes, the most common is for \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e is to install roof decking with the radiant barrier attached to the bottom of the decking.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes \u003c/a\u003enow proudly installs radiant barriers standard in all new construction as part of our continued focus on green building principles.\u003c/p\u003e\n","href":"/blog/what-is-a-radiant-barrier-on-residential-roof-decking/","link":"what-is-a-radiant-barrier-on-residential-roof-decking","objectID":"b2fea3b83408746df39c09e16958773c","title":"What is a radiant barrier on residential roof decking?","type":"post"},{"date":1357966800,"excerpt":"\u003cp\u003eYou may have seen a builder with initials after their name on a business card and often asked what that pertains to. It likely is an accreditation earned through the National Association of Home Builders (NAHB). These accreditations demonstrate a builders commitment to continuing education, customer service and an overall understanding of today’s dynamic home building industry.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e commitment to these ideals is recognized in our staff’s ability to earn Certified Graduate Builder (CGB) degrees through the NAHB. We encourage all staff to commit to classes each year to further their understanding of the changing business climate we are engaged in. Additionally, staff attend trade shows, vendor round-tables and various local home builder association education opportunities. As a top Houston custom home builder, \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes \u003c/a\u003estresses the importance of building a house that meets today’s demands and will continue its commitment to stay ahead of the building curve.\u003c/p\u003e\n","href":"/blog/why-are-nahb-designations-important/","link":"why-are-nahb-designations-important","objectID":"8e23ef0bd539950fc94d18bbbd17a2b9","title":"Why are NAHB designations important?","type":"post"},{"date":1355288400,"excerpt":"\u003cp\u003eWe are often asked about this by past clients and potential clients. The answer is Yes! During the first five months of 2009, \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e has completed 7 remodels and currently working on 4 additional jobs. Many of our current remodels are damaged homes on the Texas coasts from Hurricane Ike. We have jobs in Galveston, La Porte, Shore Acres, Bolivar Peninsula and Houston’s Inner Loop. At \u003ca href=\"http://www.onpointdevelopment.com/\"\u003eOn Point\u003c/a\u003e, we have taken pride in helping bring Texas families back to their homes post storm. We have worked diligently with insurance companies as well to ensure our clients receive fair settlements. If you are looking at a remodel, please give us a call to set us a free consultation.\u003c/p\u003e\n","href":"/blog/does-on-point-custom-homes-do-remodeling/","link":"does-on-point-custom-homes-do-remodeling","objectID":"34ab0cebeca9bf7f37718a09d0e71118","title":"Does On Point Custom Homes do remodeling?","type":"post"},{"date":1352782800,"excerpt":"\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes \u003c/a\u003euses quartz in many of our modern Houston homes. Clients often ask why we use quartz…there are many reasons, but let’s cover some of the top reasons.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eWe believe quartz gives a more modern touch to a contemporary style home than granite. It has a clean overall feel and modern enthusiasts seem to be gravitating toward quartz countertops.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEase of mainteance. Quite simply \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes \u003c/a\u003erecommends a damp cloth with warm water and soap to wipe down quartz. No reason to worry about deep stains from grease or other products.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eNo need to seal it. Quartz is non-porous so there is no need for a sealer now or in the future.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eIf you have any other quartz questions…let \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes \u003c/a\u003eknow and we will do our best to answer them!\u003c/p\u003e\n","href":"/blog/why-is-quartz-gaining-popularity-in-houston-homes/","link":"why-is-quartz-gaining-popularity-in-houston-homes","objectID":"d9d325971dae88d6228072e0599fab79","title":"Why is quartz gaining popularity in Houston homes?","type":"post"},{"date":1349496000,"excerpt":"\u003cp\u003eSummer in Houston usually brings homeowners outside to take in the pleasures of their yards. A familiar issue is mosquitoes and how to manage them, and a Houston mosquito system solution is becoming a necessity. \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e is prepared to assist by offering a \u003ca href=\"http://www.mosquitolock.com/\"\u003eMosquito Lock\u003c/a\u003e System. This innovative system allows homeowners complete control of their yard by spraying a very fine \u003ca href=\"http://www.mosquitolock.com/our-systems.html\"\u003emist\u003c/a\u003e in intervals set on a controller, and is the most desired Houston mosquito system available. Operating automatically or with a handheld remote, the 30-60 second mist drifts and settles on the landscaping, killing all mosquitoes it comes in contact with along with numerous other pests. This system has given \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point’s\u003c/a\u003e clients the freedom to enjoy being outside regardless of the season, and with additional features such as a warranty on all parts and installation, leak detection and an optional wind sensor, we are confident in providing this option to our clients. This system is also available to \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point’s\u003c/a\u003e Houston remodeling clients.\u003c/p\u003e\n\u003cp\u003eThere is still time to have this fantastic Houston mosquito system installed before the season peaks, so please contact \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e to discuss having a \u003ca href=\"http://www.mosquitolock.com/\"\u003eMosquito Lock\u003c/a\u003e System installed in your yard!\u003c/p\u003e\n","href":"/blog/do-you-install-mosquito-systems-in-houston/","link":"do-you-install-mosquito-systems-in-houston","objectID":"0053893c1067a0dda36a5a14cf852ab1","title":"Do you install mosquito systems in Houston?","type":"post"},{"date":1348459200,"excerpt":"\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e has built several Houston custom homes within the Briargrove subdivision. Established in the 1950’s, this neighborhood is highly sought-after by home buyers. Briargrove boasts in-town living with easy access to Houston’s shopping districts and entertainment venues, and is considered to be one of the most family-oriented neighborhoods in Houston. Residents enjoy a strong homeowners association and share a clubhouse, play area, pool and the award-winning Briargrove elementary. There are roughly 900 homes, and a recent surge of 2-story Houston custom homes construction along with recent street construction has helped to keep property values strong. \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e recently completed its third Briargrove custom home in the last two years at 6254 Chevy Chase Drive.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e has established itself considerably within this beautiful neighborhood with multiple custom homes and remodels completed here. We have been involved in charity work with Briargrove elementary and maintained positive ties with Briargrove’s excellent homeowners association. This has given us a unique edge in designing a product perfectly suited to homeowners looking for a neighborhood within the City offering a family-centered community to call home. Check us out on the web at \u003ca href=\"https://onpointcustomhomes.com/\"\u003ewww.onpointcustomhomes.com\u003c/a\u003e for more information.\u003c/p\u003e\n","href":"/blog/do-you-build-in-briargrove-neighborhood-in-houston-tx/","link":"do-you-build-in-briargrove-neighborhood-in-houston-tx","objectID":"1a6fbc377ca63d0931a6bc142c30c36c","title":"Do you build in Briargrove neighborhood in Houston, TX?","type":"post"},{"date":1344398400,"excerpt":"\u003cp\u003eThe area surrounding the River Oaks Shopping Center is home to many \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e designs. This historic area, located at the geographic center of Houston, offers urban living and a unique balance of nationally recognized stores, eclectic shops, and an abundance of dining options. Bordered by the Museum District to the South, Midtown and and the Downtown Theater District to the East, and River Oaks to the West, this prominent neighborhood is lined with Houston \u003ca href=\"https://onpointcustomhomes.com/\"\u003ecustom homes\u003c/a\u003eembracing a definite eclectic nature. Its residents range from politicians, musicians, artists and students to corporate executives and business professionals.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e has taken part in the continued revitalization of this locale though creating a well-defined modern product within and a presence and reputation for designing homes intended to capture the distinct diversity of the neighborhood. Our clients seeking an inner-City, uptown lifestyle have quickly fallen in love with this area, and we are pleased to have broken ground on our thirteenth custom home here at 2424 Hazard Street with 2422 Hazard and 1515 \u0026amp; 1517 Driscoll to follow thereafter.\u003c/p\u003e\n\u003cp\u003eCheck out many of our homes within the River Oaks Shopping Center by visiting \u003ca href=\"https://onpointcustomhomes.com/our-work/\" title=\"Our Work\"\u003eOn Point Custom Homes Gallery of Homes.\u003c/a\u003e\u003c/p\u003e\n","href":"/blog/i-see-a-lot-of-your-signs-in-the-river-oaks-shopping-center-area-how-much-do-you-build-there/","link":"i-see-a-lot-of-your-signs-in-the-river-oaks-shopping-center-area...how-much-do-you-build-there","objectID":"fd03345165ad7e7e7e73bf41469a4423","title":"I see a lot of your signs in the River Oaks Shopping Center area...how much do you build there?","type":"post"},{"date":1339041600,"excerpt":"\u003cp\u003eWith a great many changes in the way that home décor and home decorating is completed, there really isn’t any home that doesn’t suit modern furniture design. \u003ca href=\"http://www.onpointdevelopment.com/onpointdev.asp?category_ID=15\u0026amp;page_ID=18\"\u003eHouston modern furniture\u003c/a\u003e, like that found in all other major cities, is going to range from those styles with ethnic or cultural influences through to the ultra-modern and minimalist styles. There are several furniture stores that feature Danish or Scandinavian modern styles that look wonderful in any type of home. Many of the newer types of homes are designed to match with almost any type of interior design theme. The modern contemporary designs, similar to many \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e are a natural match, which may mean taking a stroll through contemporary show homes to get ideas is a wonderful way to spend a weekend or two.\u003c/p\u003e\n\u003cp\u003eTraditional homes can be given a very quick update and almost immediate transformation with just a few changes in furniture. Since \u003ca href=\"http://www.onpointdevelopment.com/onpointdev.asp?category_ID=15\u0026amp;page_ID=18\"\u003eHouston modern furniture\u003c/a\u003e stores provide both major pieces such as couches, chairs, table and entertainment units it isn’t hard to find one stop shopping. Decorating ideas from the many \u003ca href=\"http://www.onpointdevelopment.com/onpointdev.asp?category_ID=15\u0026amp;page_ID=18\"\u003eHouston modern furniture\u003c/a\u003e stores can also help in determining what existing furniture you have that may work within your new décor. You may not want to change the whole home, but modern furniture can spruce up an office, living space or even your kitchen.\u003c/p\u003e\n","href":"/blog/is-there-a-particular-type-of-home-that-best-suits-houston-modern-furniture-styles/","link":"is-there-a-particular-type-of-home-that-best-suits-houston-modern-furniture-styles","objectID":"a0078b79e2a1e295cfe45faeed7808a0","title":"Is there a particular type of home that best suits Houston modern furniture styles?","type":"post"},{"date":1336104000,"excerpt":"\u003cp\u003eHouston itself is really a very old city, first founded in 1836 and then incorporated the very next year. It has modest beginnings until 1901 when it became a major oil producing area as well as a railway hub. The increasing workforce that these two types of industry brought into the then small town led to very rapid growth and the demand for both economic and luxury types of homes. \u003ca href=\"https://onpointcustomhomes.com/in-progress/our-work/\" title=\"For Sale\"\u003eHouston modern homes\u003c/a\u003e are not considered to be these original structures, although many of the plantation style mansions still gloriously line the streets of the older parts of the city. Some of the refurbished and renovated original or mid-century homes are now coming on the market and they have all the features one would expect in a fully \u003ca href=\"https://onpointcustomhomes.com/in-progress/our-work/\" title=\"For Sale\"\u003emodern 21st century home.\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.onpointdevelopment.com/onpointdev.asp?category_ID=15\u0026amp;page_ID=19\"\u003eHouston modern homes\u003c/a\u003e tend to feature cutting edge design and finishes. Even renovated or remodeled older homes can be incorporate a modern interior. If you are contemplating building a new home or remodeling your existing home, please give \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e a call at 713-600-2422.\u003c/p\u003e\n","href":"/blog/what-defines-a-houston-modern-home/","link":"what-defines-a-houston-modern-home","objectID":"73e03ef81419a41fe154e265e87abbc2","title":"What defines a Houston modern home?","type":"post"},{"date":1334203200,"excerpt":"\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/in-progress/our-work/\" title=\"For Sale\"\u003eHouston modern luxury homes\u003c/a\u003e, townhomes, patio homes and condos offer an amazing range of options. This may include where they are located, what perks come with the residence and what shopping, parks, schools or other community attractions are in the area.\u003c/p\u003e\n\u003cp\u003eTypically \u003ca href=\"https://onpointcustomhomes.com/in-progress/our-work/\" title=\"For Sale\"\u003eHouston modern luxury\u003c/a\u003e townhomes and patio homes will have cutting edge design options and push the future of architectural design. If in a luxury complex, the will most typically have beautifully landscaped areas with green spaces, trees for shade and even a cocktail pool. You can also incorporate outdoor cooking areas, zen gardens, fire bowls, etc. Many neighborhoods such as Hyde Park, River Oaks Shopping Center, Southampton and Midtown enjoy\u003ca href=\"https://onpointcustomhomes.com/in-progress/our-work/\" title=\"For Sale\"\u003e Houston modern luxury\u003c/a\u003e homes. Contact \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e to preview a recent modern home we have built or to start plans on your own unique design.\u003c/p\u003e\n","href":"/blog/are-there-several-options-with-regards-to-houston-modern-luxury-homes-and-residences/","link":"are-there-several-options-with-regards-to-houston-modern-luxury-homes-and-residences","objectID":"f2453736281ede08f507b6645ad949e6","title":"Are there several options with regards to Houston modern luxury homes and residences?","type":"post"},{"date":1333080000,"excerpt":"\u003cp\u003eThere are a great number of different styles and architectural design options in the Houston modern patio homes on the market today. Some are two story, some offer high, unique ceilings, while others offer incredible open design options. These luxury homes, many which are designed specifically for the Houston modern patio home styles, offer the most variety when it comes to both interior and exterior style options.\u003c/p\u003e\n\u003cp\u003eMany builders specializing in Houston modern patio homes will provide the option for the buyer to work with the builder to customize the patio home. This typically means meeting from the ground up and allowing the Buyer to make selections from the start to finish. While the exterior design will be largely pre-set, there are often variations that can be provided to meet the buyer’s specifications. The interior design is typically the most flexible, and buyers will enjoy the sleek selections available in today’s Houston patio home market. \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e prides itself as the leader in Houston Modern Patio Homes. Please call \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point\u003c/a\u003e at 713-600-2422 to schedule a meeting a view your options.\u003c/p\u003e\n","href":"/blog/all-i-see-in-houston-is-one-story-ranch-style-houses-are-there-any-modern-inner-city-patio-homes/","link":"all-i-see-in-houston-is-one-story-ranch-style-houses-are-there-any-modern-inner-city-patio-homes","objectID":"8eb46ba53612203e685e900a22906af6","title":"All I see in Houston is one story ranch style houses, are there any modern inner city Patio Homes?","type":"post"},{"date":1331611200,"excerpt":"\u003cp\u003e\u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e was the recipient of the 2009 Pacesetter Award given out by Custom Home Magazine in conjunction with Hanley Wood and the NAHB. Each year, this prestigious award is given to approximately 10 builders across the country that exceed and define excellence in the home building industry.\u003c/p\u003e\n\u003cp\u003eOnly 8 builders across the country received this acclimation in 2008. \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e was the only builder to win this award from the State of Texas. \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e constantly strives to stay ahead of the building curve and its a memorable achievement to be recognized by our peers for our leadership roll in the home building industry.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.customhomeonline.com/industry-news.asp?sectionID=224\u0026amp;articleID=1039536\"\u003eClick here to read about On Point Custom Homes Pacesetter Award\u003c/a\u003e\u003c/p\u003e\n","href":"/blog/i-heard-you-won-the-2009-pacesetter-award-can-you-tell-me-about-it/","link":"i-heard-you-won-the-2009-pacesetter-award-can-you-tell-me-about-it","objectID":"a3265234212e1be0b8b74930aaa32a48","title":"I heard you won the 2009 Pacesetter Award, can you tell me about it?","type":"post"},{"date":1329022800,"excerpt":"\u003cp\u003eHouston modern patio homes offer the “lock and leave” lifestyle.\u003c/p\u003e\n\u003cp\u003eLock and leave is a term often used by Realtors and marketers when describing the positive attributes or features of Houston modern patio homes. This term means that the owners can simply lock up and leave the home, which is important for those that travel for business or enjoy an easy maintenance lifestyle. The lower cost of owning a Houston modern patio home makes these home types a great option for people that only want to live in Texas for part of the year, who have kids leaving for college and want to downsize or want to live in a trendy location.\u003c/p\u003e\n\u003cp\u003eAnother key feature with a lock and leave property is that there is minimal yard maintenance and upkeep. A quick weekly trip from the yard guy is about all you need to organize! No 8 hours of yard maintenance per week, leaf blowing for countless hours or sweeping the 100 ft. driveway!\u003c/p\u003e\n\u003cp\u003eCheck out \u003ca href=\"https://onpointcustomhomes.com/\"\u003eOn Point Custom Homes\u003c/a\u003e options for modern patio homes in areas such as Camp Logan, Rice Military, River Oaks, Upper Kirby and Montrose!\u003c/p\u003e\n","href":"/blog/why-a-houston-patio-home/","link":"why-a-houston-patio-home","objectID":"903abb3801454f20416477d21746d015","title":"Why a Houston Patio Home?","type":"post"},{"date":1327636246,"excerpt":"\u003cp\u003eOne of the most treasured company events of the year is our epic Secret Santa showdown! We’re one big happy family and we love getting each other crazy, creative gifts. Check out the goods!\u003c/p\u003e\n","href":"/blog/mosquito-time-in-houston/","link":"mosquito-time-in-houston","objectID":"e42198a1475b208f91e9a78591099cbe","title":"Mosquito Time in Houston!","type":"post"}]